/* automatically generated by rust-bindgen */

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub type std_conditional_type<_If> = _If;
pub type std_integral_constant_value_type<_Tp> = _Tp;
pub type std_integral_constant_type = u8;
pub type std_true_type = u8;
pub type std_false_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_const {
    pub _address: u8,
}
pub type std_remove_const_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_same {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_empty {
    pub _address: u8,
}
pub type std___all = std_is_same;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair<_T1, _T2> {
    pub first: _T1,
    pub second: _T2,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T2>>,
}
pub type std_pair_first_type<_T1> = _T1;
pub type std_pair_second_type<_T2> = _T2;
pub type std_pair__EnableB = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair__CheckArgs {
    pub _address: u8,
}
pub type std_pair__CheckArgsDep = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair__CheckTupleLikeConstructor {
    pub _address: u8,
}
pub type std_pair__CheckTLC = u8;
pub type std_istream = std_basic_istream;
pub type std_ostream = std_basic_ostream;
pub type std_streampos = std_fpos<mbstate_t>;
pub type std_streamoff = ::std::os::raw::c_longlong;
pub type std_string = std_basic_string;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binary_function {
    pub _address: u8,
}
pub type std_binary_function_first_argument_type<_Arg1> = _Arg1;
pub type std_binary_function_second_argument_type<_Arg2> = _Arg2;
pub type std_binary_function_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_input_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_input_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_input_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_input_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_input_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_input_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_forward_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_forward_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_forward_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_forward_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bidirectional_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_bidirectional_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_bidirectional_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_bidirectional_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_random_access_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_random_access_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_random_access_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_random_access_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_random_access_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_random_access_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator {
    pub _address: u8,
}
pub type std_iterator_value_type<_Tp> = _Tp;
pub type std_iterator_difference_type<_Distance> = _Distance;
pub type std_iterator_pointer<_Pointer> = _Pointer;
pub type std_iterator_reference<_Reference> = _Reference;
pub type std_iterator_iterator_category<_Category> = _Category;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reverse_iterator<_Iter> {
    pub __t: _Iter,
    pub current: _Iter,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
}
pub type std_reverse_iterator_iterator_type<_Iter> = _Iter;
pub type std_reverse_iterator_difference_type = std_iterator_traits;
pub type std_reverse_iterator_reference = std_iterator_traits;
pub type std_reverse_iterator_pointer = std_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___wrap_iter<_Iter> {
    pub __i: std___wrap_iter_iterator_type<_Iter>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
}
pub type std___wrap_iter_iterator_type<_Iter> = _Iter;
pub type std___wrap_iter_iterator_category = std_iterator_traits;
pub type std___wrap_iter_value_type = std_iterator_traits;
pub type std___wrap_iter_difference_type = std_iterator_traits;
pub type std___wrap_iter_pointer = std_iterator_traits;
pub type std___wrap_iter_reference = std_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple {
    pub __base_: std_tuple__BaseT,
}
pub type std_tuple__BaseT = std___tuple_impl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple__PackExpandsToThisTuple {
    pub _base: std_false_type,
}
pub type std_tuple__CanCopyAssign = std___all;
pub type std_tuple__CanMoveAssign = std___all;
#[repr(C)]
#[derive(Debug)]
pub struct std___libcpp_refstring {
    pub __imp_: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_std___libcpp_refstring() {
    assert_eq!(
        ::std::mem::size_of::<std___libcpp_refstring>(),
        8usize,
        concat!("Size of: ", stringify!(std___libcpp_refstring))
    );
    assert_eq!(
        ::std::mem::align_of::<std___libcpp_refstring>(),
        8usize,
        concat!("Alignment of ", stringify!(std___libcpp_refstring))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std___libcpp_refstring>())).__imp_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std___libcpp_refstring),
            "::",
            stringify!(__imp_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_atomic {
    pub _address: u8,
}
pub type std_atomic___base = u8;
pub type std___pointer_traits_difference_type_type = isize;
pub type std___pointer_traits_rebind_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits {
    pub _address: u8,
}
pub type std_pointer_traits_pointer<_Ptr> = _Ptr;
pub type std_pointer_traits_element_type = u8;
pub type std_pointer_traits_difference_type = u8;
pub type std_pointer_traits_rebind = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits___nat {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___rebind_pointer {
    pub _address: u8,
}
pub type std___rebind_pointer_type = std_pointer_traits;
pub type std___pointer_type_imp___pointer_type_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___pointer_type {
    pub _address: u8,
}
pub type std___pointer_type_type = u8;
pub type std___propagate_on_container_copy_assignment_type = std_false_type;
pub type std___propagate_on_container_move_assignment_type = std_false_type;
pub type std___propagate_on_container_swap_type = std_false_type;
pub type std___is_always_equal_type = std_is_empty;
pub type std___allocator_traits_rebind_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits {
    pub _address: u8,
}
pub type std_allocator_traits_allocator_type<_Alloc> = _Alloc;
pub type std_allocator_traits_value_type = [u8; 0usize];
pub type std_allocator_traits_pointer = [u8; 0usize];
pub type std_allocator_traits_const_pointer = [u8; 0usize];
pub type std_allocator_traits_void_pointer = [u8; 0usize];
pub type std_allocator_traits_const_void_pointer = [u8; 0usize];
pub type std_allocator_traits_difference_type = [u8; 0usize];
pub type std_allocator_traits_size_type = [u8; 0usize];
pub type std_allocator_traits_propagate_on_container_copy_assignment = u8;
pub type std_allocator_traits_propagate_on_container_move_assignment = u8;
pub type std_allocator_traits_propagate_on_container_swap = u8;
pub type std_allocator_traits_is_always_equal = u8;
pub type std_allocator_traits_rebind_alloc = u8;
pub type std_allocator_traits_rebind_traits = std_allocator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___rebind_alloc_helper {
    pub _address: u8,
}
pub type std___rebind_alloc_helper_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator {
    pub _address: u8,
}
pub type std_allocator_size_type = usize;
pub type std_allocator_difference_type = isize;
pub type std_allocator_pointer<_Tp> = *mut _Tp;
pub type std_allocator_const_pointer<_Tp> = *const _Tp;
pub type std_allocator_reference<_Tp> = *mut _Tp;
pub type std_allocator_const_reference<_Tp> = *const _Tp;
pub type std_allocator_value_type<_Tp> = _Tp;
pub type std_allocator_propagate_on_container_move_assignment = std_true_type;
pub type std_allocator_is_always_equal = std_true_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_rebind {
    pub _address: u8,
}
pub type std_allocator_rebind_other = std_allocator;
pub type std___compressed_pair_elem__ParamT<_Tp> = _Tp;
pub type std___compressed_pair_elem_reference<_Tp> = *mut _Tp;
pub type std___compressed_pair_elem_const_reference<_Tp> = *const _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___compressed_pair {
    pub _address: u8,
}
pub type std___compressed_pair__Base1 = u8;
pub type std___compressed_pair__Base2 = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_default_delete {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___unique_ptr_deleter_sfinae {
    pub _address: u8,
}
pub type std___unique_ptr_deleter_sfinae___lval_ref_type<_Deleter> = *const _Deleter;
pub type std___unique_ptr_deleter_sfinae___good_rval_ref_type<_Deleter> = *mut _Deleter;
pub type std___unique_ptr_deleter_sfinae___enable_rval_overload = std_true_type;
#[repr(C)]
#[derive(Debug)]
pub struct std_unique_ptr {
    pub __ptr_: std___compressed_pair,
}
pub type std_unique_ptr_element_type<_Tp> = _Tp;
pub type std_unique_ptr_deleter_type<_Dp> = _Dp;
pub type std_unique_ptr_pointer = std___pointer_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unique_ptr___nat {
    pub __for_bool_: ::std::os::raw::c_int,
}
pub type std_unique_ptr__DeleterSFINAE = std___unique_ptr_deleter_sfinae;
pub type std_unique_ptr__LValRefType = u8;
pub type std_unique_ptr__GoodRValRefType = u8;
pub type std_unique_ptr__BadRValRefType = u8;
pub type std_unique_ptr__EnableIfDeleterDefaultConstructible = u8;
pub type std_unique_ptr__EnableIfDeleterConstructible = u8;
pub type std_unique_ptr__EnableIfMoveConvertible = u8;
pub type std_unique_ptr__EnableIfDeleterConvertible = u8;
pub type std_unique_ptr__EnableIfDeleterAssignable = u8;
#[repr(C)]
pub struct std___shared_count__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_count {
    pub vtable_: *const std___shared_count__bindgen_vtable,
    pub __shared_owners_: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_std___shared_count() {
    assert_eq!(
        ::std::mem::size_of::<std___shared_count>(),
        16usize,
        concat!("Size of: ", stringify!(std___shared_count))
    );
    assert_eq!(
        ::std::mem::align_of::<std___shared_count>(),
        8usize,
        concat!("Alignment of ", stringify!(std___shared_count))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std___shared_count>())).__shared_owners_ as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std___shared_count),
            "::",
            stringify!(__shared_owners_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114__shared_countD1Ev"]
    pub fn std___shared_count___shared_count_destructor(this: *mut std___shared_count);
}
#[repr(C)]
#[derive(Debug)]
pub struct std___shared_weak_count {
    pub _base: std___shared_count,
    pub __shared_weak_owners_: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_std___shared_weak_count() {
    assert_eq!(
        ::std::mem::size_of::<std___shared_weak_count>(),
        24usize,
        concat!("Size of: ", stringify!(std___shared_weak_count))
    );
    assert_eq!(
        ::std::mem::align_of::<std___shared_weak_count>(),
        8usize,
        concat!("Alignment of ", stringify!(std___shared_weak_count))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std___shared_weak_count>())).__shared_weak_owners_ as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std___shared_weak_count),
            "::",
            stringify!(__shared_weak_owners_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__119__shared_weak_count14__release_weakEv"]
    pub fn std___shared_weak_count___release_weak(this: *mut std___shared_weak_count);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__119__shared_weak_count4lockEv"]
    pub fn std___shared_weak_count_lock(
        this: *mut std___shared_weak_count,
    ) -> *mut std___shared_weak_count;
}
impl std___shared_weak_count {
    #[inline]
    pub unsafe fn __release_weak(&mut self) {
        std___shared_weak_count___release_weak(self)
    }
    #[inline]
    pub unsafe fn lock(&mut self) -> *mut std___shared_weak_count {
        std___shared_weak_count_lock(self)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__119__shared_weak_countD1Ev"]
    pub fn std___shared_weak_count___shared_weak_count_destructor(
        this: *mut std___shared_weak_count,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__119__shared_weak_count13__get_deleterERKSt9type_info"]
    pub fn std___shared_weak_count___get_deleter(
        this: *mut ::std::os::raw::c_void,
        arg1: *const std_type_info,
    ) -> *const ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_shared_ptr<_Tp> {
    pub __ptr_: *mut std_shared_ptr_element_type<_Tp>,
    pub __cntrl_: *mut std___shared_weak_count,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
pub type std_shared_ptr_element_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_shared_ptr___nat {
    pub __for_bool_: ::std::os::raw::c_int,
}
pub type std_shared_ptr___shared_ptr_default_allocator_type = std_allocator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_char_traits {
    pub _address: u8,
}
pub type std_char_traits_char_type<_CharT> = _CharT;
pub type std_char_traits_int_type = ::std::os::raw::c_int;
pub type std_char_traits_off_type = std_streamoff;
pub type std_char_traits_pos_type = std_streampos;
pub type std_char_traits_state_type = mbstate_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string_view<_CharT> {
    pub __data: *const std_basic_string_view_value_type<_CharT>,
    pub __size: std_basic_string_view_size_type,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type std_basic_string_view_traits_type<_Traits> = _Traits;
pub type std_basic_string_view_value_type<_CharT> = _CharT;
pub type std_basic_string_view_pointer<_CharT> = *mut _CharT;
pub type std_basic_string_view_const_pointer<_CharT> = *const _CharT;
pub type std_basic_string_view_reference<_CharT> = *mut _CharT;
pub type std_basic_string_view_const_reference<_CharT> = *const _CharT;
pub type std_basic_string_view_const_iterator<_CharT> = std_basic_string_view_const_pointer<_CharT>;
pub type std_basic_string_view_iterator<_CharT> = std_basic_string_view_const_iterator<_CharT>;
pub type std_basic_string_view_const_reverse_iterator<_CharT> =
    std_reverse_iterator<std_basic_string_view_const_iterator<_CharT>>;
pub type std_basic_string_view_reverse_iterator<_CharT> =
    std_basic_string_view_const_reverse_iterator<_CharT>;
pub type std_basic_string_view_size_type = usize;
pub type std_basic_string_view_difference_type = isize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_fpos<_StateT> {
    pub __st_: _StateT,
    pub __off_: std_streamoff,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_StateT>>,
}
extern "C" {
    #[link_name = "\u{1}__throw_length_error"]
    pub fn std___basic_string_common___throw_length_error(this: *const u8);
}
extern "C" {
    #[link_name = "\u{1}__throw_out_of_range"]
    pub fn std___basic_string_common___throw_out_of_range(this: *const u8);
}
#[repr(C)]
pub struct std_basic_string {
    pub _base: u8,
    pub __r_: std___compressed_pair,
}
pub type std_basic_string___self = std_basic_string;
pub type std_basic_string___self_view<_CharT> = std_basic_string_view<_CharT>;
pub type std_basic_string_traits_type<_Traits> = _Traits;
pub type std_basic_string_value_type<_CharT> = _CharT;
pub type std_basic_string_allocator_type<_Allocator> = _Allocator;
pub type std_basic_string___alloc_traits = std_allocator_traits;
pub type std_basic_string_size_type = std_basic_string___alloc_traits;
pub type std_basic_string_difference_type = std_basic_string___alloc_traits;
pub type std_basic_string_reference<_CharT> = *mut std_basic_string_value_type<_CharT>;
pub type std_basic_string_const_reference<_CharT> = *const std_basic_string_value_type<_CharT>;
pub type std_basic_string_pointer = std_basic_string___alloc_traits;
pub type std_basic_string_const_pointer = std_basic_string___alloc_traits;
pub type std_basic_string_iterator = std___wrap_iter<std_basic_string_pointer>;
pub type std_basic_string_const_iterator = std___wrap_iter<std_basic_string_const_pointer>;
pub type std_basic_string_reverse_iterator = std_reverse_iterator<std_basic_string_iterator>;
pub type std_basic_string_const_reverse_iterator =
    std_reverse_iterator<std_basic_string_const_iterator>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___long {
    pub __cap_: std_basic_string_size_type,
    pub __size_: std_basic_string_size_type,
    pub __data_: std_basic_string_pointer,
}
pub const std_basic_string___min_cap: std_basic_string__bindgen_ty_1 = 0;
pub type std_basic_string__bindgen_ty_1 = i32;
#[repr(C)]
pub struct std_basic_string___short<_CharT> {
    pub __bindgen_anon_1: std_basic_string___short__bindgen_ty_1<_CharT>,
    pub __data_: *mut std_basic_string_value_type<_CharT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
#[repr(C)]
pub union std_basic_string___short__bindgen_ty_1<_CharT> {
    pub __size_: ::std::os::raw::c_uchar,
    pub __lx: std_basic_string_value_type<_CharT>,
    _bindgen_union_align: u8,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
#[repr(C)]
pub struct std_basic_string___ulx<_CharT> {
    pub __lx: __BindgenUnionField<std_basic_string___long>,
    pub __lxx: __BindgenUnionField<std_basic_string___short<_CharT>>,
    pub bindgen_union_field: [u8; 0usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub const std_basic_string___n_words: std_basic_string__bindgen_ty_2 = 0;
pub type std_basic_string__bindgen_ty_2 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___raw {
    pub __words: *mut std_basic_string_size_type,
}
#[repr(C)]
pub struct std_basic_string___rep<_CharT> {
    pub __bindgen_anon_1: std_basic_string___rep__bindgen_ty_1<_CharT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
#[repr(C)]
pub struct std_basic_string___rep__bindgen_ty_1<_CharT> {
    pub __l: __BindgenUnionField<std_basic_string___long>,
    pub __s: __BindgenUnionField<std_basic_string___short<_CharT>>,
    pub __r: __BindgenUnionField<std_basic_string___raw>,
    pub bindgen_union_field: [u8; 0usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub const std_basic_string___alignment: std_basic_string__bindgen_ty_3 = 0;
pub type std_basic_string__bindgen_ty_3 = i32;
#[repr(C)]
pub struct std_error_category__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_error_category {
    pub vtable_: *const std_error_category__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_std_error_category() {
    assert_eq!(
        ::std::mem::size_of::<std_error_category>(),
        8usize,
        concat!("Size of: ", stringify!(std_error_category))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_category>(),
        8usize,
        concat!("Alignment of ", stringify!(std_error_category))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__114error_categoryD1Ev"]
    pub fn std_error_category_error_category_destructor(this: *mut std_error_category);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__114error_category23default_error_conditionEi"]
    pub fn std_error_category_default_error_condition(
        this: *mut ::std::os::raw::c_void,
        __ev: ::std::os::raw::c_int,
    ) -> std_error_condition;
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__114error_category10equivalentEiRKNS_15error_conditionE"]
    pub fn std_error_category_equivalent(
        this: *mut ::std::os::raw::c_void,
        __code: ::std::os::raw::c_int,
        __condition: *const std_error_condition,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__114error_category10equivalentERKNS_10error_codeEi"]
    pub fn std_error_category_equivalent1(
        this: *mut ::std::os::raw::c_void,
        __code: *const std_error_code,
        __condition: ::std::os::raw::c_int,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_error_condition {
    pub __val_: ::std::os::raw::c_int,
    pub __cat_: *const std_error_category,
}
#[test]
fn bindgen_test_layout_std_error_condition() {
    assert_eq!(
        ::std::mem::size_of::<std_error_condition>(),
        16usize,
        concat!("Size of: ", stringify!(std_error_condition))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_condition>(),
        8usize,
        concat!("Alignment of ", stringify!(std_error_condition))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_error_condition>())).__val_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_error_condition),
            "::",
            stringify!(__val_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_error_condition>())).__cat_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_error_condition),
            "::",
            stringify!(__cat_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__115error_condition7messageEv"]
    pub fn std_error_condition_message(this: *const std_error_condition) -> std_string;
}
impl std_error_condition {
    #[inline]
    pub unsafe fn message(&self) -> std_string {
        std_error_condition_message(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_error_code {
    pub __val_: ::std::os::raw::c_int,
    pub __cat_: *const std_error_category,
}
#[test]
fn bindgen_test_layout_std_error_code() {
    assert_eq!(
        ::std::mem::size_of::<std_error_code>(),
        16usize,
        concat!("Size of: ", stringify!(std_error_code))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_code>(),
        8usize,
        concat!("Alignment of ", stringify!(std_error_code))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_error_code>())).__val_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_error_code),
            "::",
            stringify!(__val_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_error_code>())).__cat_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_error_code),
            "::",
            stringify!(__cat_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__110error_code7messageEv"]
    pub fn std_error_code_message(this: *const std_error_code) -> std_string;
}
impl std_error_code {
    #[inline]
    pub unsafe fn message(&self) -> std_string {
        std_error_code_message(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_system_error {
    pub _base: std_runtime_error,
    pub __ec_: std_error_code,
}
#[test]
fn bindgen_test_layout_std_system_error() {
    assert_eq!(
        ::std::mem::size_of::<std_system_error>(),
        32usize,
        concat!("Size of: ", stringify!(std_system_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_system_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_system_error))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_system_error>())).__ec_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_system_error),
            "::",
            stringify!(__ec_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std_system_error_system_error(
        this: *mut std_system_error,
        __ec: std_error_code,
        __what_arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeEPKc"]
    pub fn std_system_error_system_error1(
        this: *mut std_system_error,
        __ec: std_error_code,
        __what_arg: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1ENS_10error_codeE"]
    pub fn std_system_error_system_error2(this: *mut std_system_error, __ec: std_error_code);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std_system_error_system_error3(
        this: *mut std_system_error,
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryEPKc"]
    pub fn std_system_error_system_error4(
        this: *mut std_system_error,
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorC1EiRKNS_14error_categoryE"]
    pub fn std_system_error_system_error5(
        this: *mut std_system_error,
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
    );
}
impl std_system_error {
    #[inline]
    pub unsafe fn new(__ec: std_error_code, __what_arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_system_error_system_error(&mut __bindgen_tmp, __ec, __what_arg);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(__ec: std_error_code, __what_arg: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_system_error_system_error1(&mut __bindgen_tmp, __ec, __what_arg);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new2(__ec: std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_system_error_system_error2(&mut __bindgen_tmp, __ec);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new3(
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const std_string,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_system_error_system_error3(&mut __bindgen_tmp, __ev, __ecat, __what_arg);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new4(
        __ev: ::std::os::raw::c_int,
        __ecat: *const std_error_category,
        __what_arg: *const ::std::os::raw::c_char,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_system_error_system_error4(&mut __bindgen_tmp, __ev, __ecat, __what_arg);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new5(__ev: ::std::os::raw::c_int, __ecat: *const std_error_category) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_system_error_system_error5(&mut __bindgen_tmp, __ev, __ecat);
        __bindgen_tmp
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__112system_errorD1Ev"]
    pub fn std_system_error_system_error_destructor(this: *mut std_system_error);
}
pub type std___libcpp_mutex_t = pthread_mutex_t;
pub type std___libcpp_recursive_mutex_t = pthread_mutex_t;
pub type std___libcpp_condvar_t = pthread_cond_t;
#[repr(C)]
pub struct std_mutex {
    pub __m_: std___libcpp_mutex_t,
}
pub type std_mutex_native_handle_type = *mut std___libcpp_mutex_t;
#[test]
fn bindgen_test_layout_std_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_mutex>(),
        64usize,
        concat!("Size of: ", stringify!(std_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(std_mutex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_mutex>())).__m_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_mutex),
            "::",
            stringify!(__m_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutex4lockEv"]
    pub fn std_mutex_lock(this: *mut std_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutex8try_lockEv"]
    pub fn std_mutex_try_lock(this: *mut std_mutex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutex6unlockEv"]
    pub fn std_mutex_unlock(this: *mut std_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__15mutexD1Ev"]
    pub fn std_mutex_mutex_destructor(this: *mut std_mutex);
}
impl std_mutex {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std_mutex_lock(self)
    }
    #[inline]
    pub unsafe fn try_lock(&mut self) -> bool {
        std_mutex_try_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std_mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_mutex_mutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_unique_lock<_Mutex> {
    pub __m_: *mut std_unique_lock_mutex_type<_Mutex>,
    pub __owns_: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Mutex>>,
}
pub type std_unique_lock_mutex_type<_Mutex> = _Mutex;
#[repr(C)]
pub struct std_condition_variable {
    pub __cv_: std___libcpp_condvar_t,
}
pub type std_condition_variable_native_handle_type = *mut std___libcpp_condvar_t;
#[test]
fn bindgen_test_layout_std_condition_variable() {
    assert_eq!(
        ::std::mem::size_of::<std_condition_variable>(),
        48usize,
        concat!("Size of: ", stringify!(std_condition_variable))
    );
    assert_eq!(
        ::std::mem::align_of::<std_condition_variable>(),
        8usize,
        concat!("Alignment of ", stringify!(std_condition_variable))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_condition_variable>())).__cv_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_condition_variable),
            "::",
            stringify!(__cv_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variable10notify_oneEv"]
    pub fn std_condition_variable_notify_one(this: *mut std_condition_variable);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variable10notify_allEv"]
    pub fn std_condition_variable_notify_all(this: *mut std_condition_variable);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variable4waitERNS_11unique_lockINS_5mutexEEE"]
    pub fn std_condition_variable_wait(
        this: *mut std_condition_variable,
        __lk: *mut std_unique_lock<std_mutex>,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__118condition_variableD1Ev"]
    pub fn std_condition_variable_condition_variable_destructor(this: *mut std_condition_variable);
}
impl std_condition_variable {
    #[inline]
    pub unsafe fn notify_one(&mut self) {
        std_condition_variable_notify_one(self)
    }
    #[inline]
    pub unsafe fn notify_all(&mut self) {
        std_condition_variable_notify_all(self)
    }
    #[inline]
    pub unsafe fn wait(&mut self, __lk: *mut std_unique_lock<std_mutex>) {
        std_condition_variable_wait(self, __lk)
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_condition_variable_condition_variable_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tree_node_types {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_tree_node_types {
    pub _address: u8,
}
pub type std___make_tree_node_types__NodePtr = std___rebind_pointer;
pub type std___make_tree_node_types_type = std___tree_node_types;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tree_node_destructor<_Allocator> {
    pub __na_: *mut std___tree_node_destructor_allocator_type<_Allocator>,
    pub __value_constructed: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Allocator>>,
}
pub type std___tree_node_destructor_allocator_type<_Allocator> = _Allocator;
pub type std___tree_node_destructor___alloc_traits = std_allocator_traits;
pub type std___tree_node_destructor_pointer = std___tree_node_destructor___alloc_traits;
pub type std___tree_node_destructor__NodeTypes = std___tree_node_types;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tree_iterator {
    pub __ptr_: std___tree_iterator___iter_pointer,
}
pub type std___tree_iterator__NodeTypes = std___tree_node_types;
pub type std___tree_iterator___node_pointer<_NodePtr> = _NodePtr;
pub type std___tree_iterator___node_base_pointer = std___tree_iterator__NodeTypes;
pub type std___tree_iterator___end_node_pointer = std___tree_iterator__NodeTypes;
pub type std___tree_iterator___iter_pointer = std___tree_iterator__NodeTypes;
pub type std___tree_iterator___pointer_traits = std_pointer_traits;
pub type std___tree_iterator_iterator_category = std_bidirectional_iterator_tag;
pub type std___tree_iterator_value_type<_Tp> = _Tp;
pub type std___tree_iterator_difference_type<_DiffType> = _DiffType;
pub type std___tree_iterator_reference<_Tp> = *mut std___tree_iterator_value_type<_Tp>;
pub type std___tree_iterator_pointer = std___tree_iterator__NodeTypes;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tree_const_iterator {
    pub __ptr_: std___tree_const_iterator___iter_pointer,
}
pub type std___tree_const_iterator__NodeTypes = std___tree_node_types;
pub type std___tree_const_iterator___node_pointer = std___tree_const_iterator__NodeTypes;
pub type std___tree_const_iterator___node_base_pointer = std___tree_const_iterator__NodeTypes;
pub type std___tree_const_iterator___end_node_pointer = std___tree_const_iterator__NodeTypes;
pub type std___tree_const_iterator___iter_pointer = std___tree_const_iterator__NodeTypes;
pub type std___tree_const_iterator___pointer_traits = std_pointer_traits;
pub type std___tree_const_iterator_iterator_category = std_bidirectional_iterator_tag;
pub type std___tree_const_iterator_value_type<_Tp> = _Tp;
pub type std___tree_const_iterator_difference_type<_DiffType> = _DiffType;
pub type std___tree_const_iterator_reference<_Tp> =
    *const std___tree_const_iterator_value_type<_Tp>;
pub type std___tree_const_iterator_pointer = std___tree_const_iterator__NodeTypes;
pub type std___tree_const_iterator___non_const_iterator = std___tree_iterator;
#[repr(C)]
#[derive(Debug)]
pub struct std___tree {
    pub __begin_node_: std___tree___iter_pointer,
    pub __pair1_: std___compressed_pair,
    pub __pair3_: std___compressed_pair,
}
pub type std___tree_value_type<_Tp> = _Tp;
pub type std___tree_value_compare<_Compare> = _Compare;
pub type std___tree_allocator_type<_Allocator> = _Allocator;
pub type std___tree___alloc_traits = std_allocator_traits;
pub type std___tree__NodeTypes = std___make_tree_node_types;
pub type std___tree_key_type = std___tree__NodeTypes;
pub type std___tree___node_value_type = std___tree__NodeTypes;
pub type std___tree___container_value_type = std___tree__NodeTypes;
pub type std___tree_pointer = std___tree___alloc_traits;
pub type std___tree_const_pointer = std___tree___alloc_traits;
pub type std___tree_size_type = std___tree___alloc_traits;
pub type std___tree_difference_type = std___tree___alloc_traits;
pub type std___tree___void_pointer = std___tree__NodeTypes;
pub type std___tree___node = std___tree__NodeTypes;
pub type std___tree___node_pointer = std___tree__NodeTypes;
pub type std___tree___node_base = std___tree__NodeTypes;
pub type std___tree___node_base_pointer = std___tree__NodeTypes;
pub type std___tree___end_node_t = std___tree__NodeTypes;
pub type std___tree___end_node_ptr = std___tree__NodeTypes;
pub type std___tree___parent_pointer = std___tree__NodeTypes;
pub type std___tree___iter_pointer = std___tree__NodeTypes;
pub type std___tree___node_allocator = std___rebind_alloc_helper;
pub type std___tree___node_traits = std_allocator_traits;
pub type std___tree___node_base_allocator = std___rebind_alloc_helper;
pub type std___tree___node_base_traits = std_allocator_traits;
pub type std___tree__Dp = std___tree_node_destructor<std___tree___node_allocator>;
pub type std___tree___node_holder = std_unique_ptr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___map_node_destructor<_Allocator> {
    pub __na_: *mut std___map_node_destructor_allocator_type<_Allocator>,
    pub __first_constructed: bool,
    pub __second_constructed: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Allocator>>,
}
pub type std___map_node_destructor_allocator_type<_Allocator> = _Allocator;
pub type std___map_node_destructor___alloc_traits = std_allocator_traits;
pub type std___map_node_destructor_pointer = std___map_node_destructor___alloc_traits;
#[repr(C)]
#[derive(Debug)]
pub struct std___value_type<_Key, _Tp> {
    pub __cc: std___value_type_value_type<_Key, _Tp>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Key>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
pub type std___value_type_key_type<_Key> = _Key;
pub type std___value_type_mapped_type<_Tp> = _Tp;
pub type std___value_type_value_type<_Key, _Tp> =
    std_pair<std___value_type_key_type<_Key>, std___value_type_mapped_type<_Tp>>;
pub type std___value_type___nc_ref_pair_type<_Key, _Tp> =
    std_pair<std___value_type_key_type<_Key>, std___value_type_mapped_type<_Tp>>;
pub type std___value_type___nc_rref_pair_type<_Key, _Tp> =
    std_pair<std___value_type_key_type<_Key>, std___value_type_mapped_type<_Tp>>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___map_iterator<_TreeIterator> {
    pub __i_: _TreeIterator,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_TreeIterator>>,
}
pub type std___map_iterator__NodeTypes = [u8; 0usize];
pub type std___map_iterator___pointer_traits = [u8; 0usize];
pub type std___map_iterator_iterator_category = std_bidirectional_iterator_tag;
pub type std___map_iterator_value_type = [u8; 0usize];
pub type std___map_iterator_difference_type = [u8; 0usize];
pub type std___map_iterator_reference = *mut std___map_iterator_value_type;
pub type std___map_iterator_pointer = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___map_const_iterator<_TreeIterator> {
    pub __i_: _TreeIterator,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_TreeIterator>>,
}
pub type std___map_const_iterator__NodeTypes = [u8; 0usize];
pub type std___map_const_iterator___pointer_traits = [u8; 0usize];
pub type std___map_const_iterator_iterator_category = std_bidirectional_iterator_tag;
pub type std___map_const_iterator_value_type = [u8; 0usize];
pub type std___map_const_iterator_difference_type = [u8; 0usize];
pub type std___map_const_iterator_reference = *const std___map_const_iterator_value_type;
pub type std___map_const_iterator_pointer = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct std_map {
    pub __tree_: std_map___base,
}
pub type std_map_key_type<_Key> = _Key;
pub type std_map_mapped_type<_Tp> = _Tp;
pub type std_map_value_type<_Key, _Tp> = std_pair<std_map_key_type<_Key>, std_map_mapped_type<_Tp>>;
pub type std_map_key_compare<_Compare> = _Compare;
pub type std_map_allocator_type<_Allocator> = _Allocator;
pub type std_map_reference<_Key, _Tp> = *mut std_map_value_type<_Key, _Tp>;
pub type std_map_const_reference<_Key, _Tp> = *const std_map_value_type<_Key, _Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_map_value_compare<_Compare> {
    pub comp: std_map_key_compare<_Compare>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
}
pub type std_map___value_type<_Key, _Tp> =
    std___value_type<std_map_key_type<_Key>, std_map_mapped_type<_Tp>>;
pub type std_map___vc = u8;
pub type std_map___allocator_type = std___rebind_alloc_helper;
pub type std_map___base = std___tree;
pub type std_map___node_traits = std_map___base;
pub type std_map___alloc_traits = std_allocator_traits;
pub type std_map_pointer = std_map___alloc_traits;
pub type std_map_const_pointer = std_map___alloc_traits;
pub type std_map_size_type = std_map___alloc_traits;
pub type std_map_difference_type = std_map___alloc_traits;
pub type std_map_iterator = std___map_iterator<std_map___base>;
pub type std_map_const_iterator = std___map_const_iterator<std_map___base>;
pub type std_map_reverse_iterator = std_reverse_iterator<std_map_iterator>;
pub type std_map_const_reverse_iterator = std_reverse_iterator<std_map_const_iterator>;
pub type std_map___node = std_map___base;
pub type std_map___node_allocator = std_map___base;
pub type std_map___node_pointer = std_map___base;
pub type std_map___node_base_pointer = std_map___base;
pub type std_map___parent_pointer = std_map___base;
pub type std_map__Dp = std___map_node_destructor<std_map___node_allocator>;
pub type std_map___node_holder = std_unique_ptr;
#[repr(C)]
pub struct std_recursive_mutex {
    pub __m_: std___libcpp_recursive_mutex_t,
}
pub type std_recursive_mutex_native_handle_type = *mut std___libcpp_recursive_mutex_t;
#[test]
fn bindgen_test_layout_std_recursive_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_recursive_mutex>(),
        64usize,
        concat!("Size of: ", stringify!(std_recursive_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_recursive_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(std_recursive_mutex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_recursive_mutex>())).__m_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_recursive_mutex),
            "::",
            stringify!(__m_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutex4lockEv"]
    pub fn std_recursive_mutex_lock(this: *mut std_recursive_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutex8try_lockEv"]
    pub fn std_recursive_mutex_try_lock(this: *mut std_recursive_mutex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutex6unlockEv"]
    pub fn std_recursive_mutex_unlock(this: *mut std_recursive_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutexC1Ev"]
    pub fn std_recursive_mutex_recursive_mutex(this: *mut std_recursive_mutex);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__115recursive_mutexD1Ev"]
    pub fn std_recursive_mutex_recursive_mutex_destructor(this: *mut std_recursive_mutex);
}
impl std_recursive_mutex {
    #[inline]
    pub unsafe fn lock(&mut self) {
        std_recursive_mutex_lock(self)
    }
    #[inline]
    pub unsafe fn try_lock(&mut self) -> bool {
        std_recursive_mutex_try_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        std_recursive_mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_recursive_mutex_recursive_mutex(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_recursive_mutex_recursive_mutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_once_flag {
    pub __state_: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_std_once_flag() {
    assert_eq!(
        ::std::mem::size_of::<std_once_flag>(),
        8usize,
        concat!("Size of: ", stringify!(std_once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_once_flag>(),
        8usize,
        concat!("Alignment of ", stringify!(std_once_flag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_once_flag>())).__state_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_once_flag),
            "::",
            stringify!(__state_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__throw_length_error"]
    pub fn std___vector_base_common___throw_length_error(this: *const u8);
}
extern "C" {
    #[link_name = "\u{1}__throw_out_of_range"]
    pub fn std___vector_base_common___throw_out_of_range(this: *const u8);
}
#[repr(C)]
#[derive(Debug)]
pub struct std___vector_base {
    pub _base: u8,
    pub __begin_: std___vector_base_pointer,
    pub __end_: std___vector_base_pointer,
    pub __end_cap_: std___compressed_pair,
}
pub type std___vector_base_allocator_type<_Allocator> = _Allocator;
pub type std___vector_base___alloc_traits = std_allocator_traits;
pub type std___vector_base_size_type = std___vector_base___alloc_traits;
pub type std___vector_base_value_type<_Tp> = _Tp;
pub type std___vector_base_reference<_Tp> = *mut std___vector_base_value_type<_Tp>;
pub type std___vector_base_const_reference<_Tp> = *const std___vector_base_value_type<_Tp>;
pub type std___vector_base_difference_type = std___vector_base___alloc_traits;
pub type std___vector_base_pointer = std___vector_base___alloc_traits;
pub type std___vector_base_const_pointer = std___vector_base___alloc_traits;
pub type std___vector_base_iterator = std___vector_base_pointer;
pub type std___vector_base_const_iterator = std___vector_base_const_pointer;
#[repr(C)]
#[derive(Debug)]
pub struct std_vector {
    pub _base: std___vector_base,
}
pub type std_vector___base = std___vector_base;
pub type std_vector___default_allocator_type = std_allocator;
pub type std_vector___self = std_vector;
pub type std_vector_value_type<_Tp> = _Tp;
pub type std_vector_allocator_type<_Allocator> = _Allocator;
pub type std_vector___alloc_traits = std_vector___base;
pub type std_vector_reference = std_vector___base;
pub type std_vector_const_reference = std_vector___base;
pub type std_vector_size_type = std_vector___base;
pub type std_vector_difference_type = std_vector___base;
pub type std_vector_pointer = std_vector___base;
pub type std_vector_const_pointer = std_vector___base;
pub type std_vector_iterator = std___wrap_iter<std_vector_pointer>;
pub type std_vector_const_iterator = std___wrap_iter<std_vector_const_pointer>;
pub type std_vector_reverse_iterator = std_reverse_iterator<std_vector_iterator>;
pub type std_vector_const_reverse_iterator = std_reverse_iterator<std_vector_const_iterator>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_vector___RAII_IncreaseAnnotator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_locale {
    pub __locale_: *mut std_locale___imp,
}
pub type std_locale_category = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_locale___imp {
    _unused: [u8; 0],
}
pub const std_locale_none: std_locale_category = 0;
pub const std_locale_collate: std_locale_category = 1;
pub const std_locale_ctype: std_locale_category = 2;
pub const std_locale_monetary: std_locale_category = 8;
pub const std_locale_numeric: std_locale_category = 16;
pub const std_locale_time: std_locale_category = 32;
pub const std_locale_messages: std_locale_category = 4;
pub const std_locale_all: std_locale_category = 63;
#[test]
fn bindgen_test_layout_std_locale() {
    assert_eq!(
        ::std::mem::size_of::<std_locale>(),
        8usize,
        concat!("Size of: ", stringify!(std_locale))
    );
    assert_eq!(
        ::std::mem::align_of::<std_locale>(),
        8usize,
        concat!("Alignment of ", stringify!(std_locale))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_locale>())).__locale_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_locale),
            "::",
            stringify!(__locale_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__16locale4nameEv"]
    pub fn std_locale_name(this: *const std_locale) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale6globalERKS0_"]
    pub fn std_locale_global(arg1: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale7classicEv"]
    pub fn std_locale_classic() -> *const std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1Ev"]
    pub fn std_locale_locale(this: *mut std_locale);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_"]
    pub fn std_locale_locale1(this: *mut std_locale, arg1: *const std_locale);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1EPKc"]
    pub fn std_locale_locale2(this: *mut std_locale, arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn std_locale_locale3(this: *mut std_locale, arg1: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_PKci"]
    pub fn std_locale_locale4(
        this: *mut std_locale,
        arg1: *const std_locale,
        arg2: *const ::std::os::raw::c_char,
        arg3: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_RKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEi"]
    pub fn std_locale_locale5(
        this: *mut std_locale,
        arg1: *const std_locale,
        arg2: *const std_string,
        arg3: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeC1ERKS0_S2_i"]
    pub fn std_locale_locale6(
        this: *mut std_locale,
        arg1: *const std_locale,
        arg2: *const std_locale,
        arg3: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16localeD1Ev"]
    pub fn std_locale_locale_destructor(this: *mut std_locale);
}
impl std_locale {
    #[inline]
    pub unsafe fn name(&self) -> std_string {
        std_locale_name(self)
    }
    #[inline]
    pub unsafe fn global(arg1: *const std_locale) -> std_locale {
        std_locale_global(arg1)
    }
    #[inline]
    pub unsafe fn classic() -> *const std_locale {
        std_locale_classic()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(arg1: *const std_locale) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale1(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new2(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale2(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new3(arg1: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale3(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new4(
        arg1: *const std_locale,
        arg2: *const ::std::os::raw::c_char,
        arg3: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale4(&mut __bindgen_tmp, arg1, arg2, arg3);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new5(
        arg1: *const std_locale,
        arg2: *const std_string,
        arg3: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale5(&mut __bindgen_tmp, arg1, arg2, arg3);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new6(
        arg1: *const std_locale,
        arg2: *const std_locale,
        arg3: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale6(&mut __bindgen_tmp, arg1, arg2, arg3);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_locale_locale_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_locale_facet {
    pub _base: std___shared_count,
}
#[test]
fn bindgen_test_layout_std_locale_facet() {
    assert_eq!(
        ::std::mem::size_of::<std_locale_facet>(),
        16usize,
        concat!("Size of: ", stringify!(std_locale_facet))
    );
    assert_eq!(
        ::std::mem::align_of::<std_locale_facet>(),
        8usize,
        concat!("Alignment of ", stringify!(std_locale_facet))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale5facetD1Ev"]
    pub fn std_locale_facet_facet_destructor(this: *mut std_locale_facet);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_locale_id {
    pub __flag_: std_once_flag,
    pub __id_: i32,
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale2id9__next_idE"]
    pub static mut std_locale_id___next_id: i32;
}
#[test]
fn bindgen_test_layout_std_locale_id() {
    assert_eq!(
        ::std::mem::size_of::<std_locale_id>(),
        16usize,
        concat!("Size of: ", stringify!(std_locale_id))
    );
    assert_eq!(
        ::std::mem::align_of::<std_locale_id>(),
        8usize,
        concat!("Alignment of ", stringify!(std_locale_id))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_locale_id>())).__flag_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_locale_id),
            "::",
            stringify!(__flag_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_locale_id>())).__id_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_locale_id),
            "::",
            stringify!(__id_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__16locale2id5__getEv"]
    pub fn std_locale_id___get(this: *mut std_locale_id) -> ::std::os::raw::c_long;
}
impl std_locale_id {
    #[inline]
    pub unsafe fn __get(&mut self) -> ::std::os::raw::c_long {
        std_locale_id___get(self)
    }
}
pub type std_streamsize = isize;
#[repr(C)]
pub struct std_ios_base__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base {
    pub vtable_: *const std_ios_base__bindgen_vtable,
    pub __fmtflags_: std_ios_base_fmtflags,
    pub __precision_: std_streamsize,
    pub __width_: std_streamsize,
    pub __rdstate_: std_ios_base_iostate,
    pub __exceptions_: std_ios_base_iostate,
    pub __rdbuf_: *mut ::std::os::raw::c_void,
    pub __loc_: *mut ::std::os::raw::c_void,
    pub __fn_: *mut std_ios_base_event_callback,
    pub __index_: *mut ::std::os::raw::c_int,
    pub __event_size_: usize,
    pub __event_cap_: usize,
    pub __iarray_: *mut ::std::os::raw::c_long,
    pub __iarray_size_: usize,
    pub __iarray_cap_: usize,
    pub __parray_: *mut *mut ::std::os::raw::c_void,
    pub __parray_size_: usize,
    pub __parray_cap_: usize,
}
pub type std_ios_base_fmtflags = ::std::os::raw::c_uint;
pub type std_ios_base_iostate = ::std::os::raw::c_uint;
pub type std_ios_base_openmode = ::std::os::raw::c_uint;
pub const std_ios_base_seekdir_beg: std_ios_base_seekdir = 0;
pub const std_ios_base_seekdir_cur: std_ios_base_seekdir = 1;
pub const std_ios_base_seekdir_end: std_ios_base_seekdir = 2;
pub type std_ios_base_seekdir = u32;
pub type std_ios_base_io_state = std_ios_base_iostate;
pub type std_ios_base_open_mode = std_ios_base_openmode;
pub use self::std_ios_base_seekdir as std_ios_base_seek_dir;
pub type std_ios_base_streamoff = std_streamoff;
pub type std_ios_base_streampos = std_streampos;
pub const std_ios_base_event_erase_event: std_ios_base_event = 0;
pub const std_ios_base_event_imbue_event: std_ios_base_event = 1;
pub const std_ios_base_event_copyfmt_event: std_ios_base_event = 2;
pub type std_ios_base_event = u32;
pub type std_ios_base_event_callback = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: std_ios_base_event,
        arg2: *mut std_ios_base,
        __index: ::std::os::raw::c_int,
    ),
>;
pub const std_ios_base_boolalpha: std_ios_base_fmtflags = 1;
pub const std_ios_base_dec: std_ios_base_fmtflags = 2;
pub const std_ios_base_fixed: std_ios_base_fmtflags = 4;
pub const std_ios_base_hex: std_ios_base_fmtflags = 8;
pub const std_ios_base_internal: std_ios_base_fmtflags = 16;
pub const std_ios_base_left: std_ios_base_fmtflags = 32;
pub const std_ios_base_oct: std_ios_base_fmtflags = 64;
pub const std_ios_base_right: std_ios_base_fmtflags = 128;
pub const std_ios_base_scientific: std_ios_base_fmtflags = 256;
pub const std_ios_base_showbase: std_ios_base_fmtflags = 512;
pub const std_ios_base_showpoint: std_ios_base_fmtflags = 1024;
pub const std_ios_base_showpos: std_ios_base_fmtflags = 2048;
pub const std_ios_base_skipws: std_ios_base_fmtflags = 4096;
pub const std_ios_base_unitbuf: std_ios_base_fmtflags = 8192;
pub const std_ios_base_uppercase: std_ios_base_fmtflags = 16384;
pub const std_ios_base_adjustfield: std_ios_base_fmtflags = 176;
pub const std_ios_base_basefield: std_ios_base_fmtflags = 74;
pub const std_ios_base_floatfield: std_ios_base_fmtflags = 260;
pub const std_ios_base_badbit: std_ios_base_iostate = 1;
pub const std_ios_base_eofbit: std_ios_base_iostate = 2;
pub const std_ios_base_failbit: std_ios_base_iostate = 4;
pub const std_ios_base_goodbit: std_ios_base_iostate = 0;
pub const std_ios_base_app: std_ios_base_openmode = 1;
pub const std_ios_base_ate: std_ios_base_openmode = 2;
pub const std_ios_base_binary: std_ios_base_openmode = 4;
pub const std_ios_base_in: std_ios_base_openmode = 8;
pub const std_ios_base_out: std_ios_base_openmode = 16;
pub const std_ios_base_trunc: std_ios_base_openmode = 32;
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base9__xindex_E"]
    pub static mut std_ios_base___xindex_: std_atomic;
}
#[test]
fn bindgen_test_layout_std_ios_base() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base>(),
        136usize,
        concat!("Size of: ", stringify!(std_ios_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base>(),
        8usize,
        concat!("Alignment of ", stringify!(std_ios_base))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__fmtflags_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__fmtflags_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__precision_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__precision_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__width_ as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__width_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__rdstate_ as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__rdstate_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__exceptions_ as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__exceptions_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__rdbuf_ as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__rdbuf_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__loc_ as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__loc_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__fn_ as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__fn_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__index_ as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__index_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__event_size_ as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__event_size_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__event_cap_ as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__event_cap_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__iarray_ as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__iarray_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__iarray_size_ as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__iarray_size_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__iarray_cap_ as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__iarray_cap_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__parray_ as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__parray_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__parray_size_ as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__parray_size_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_ios_base>())).__parray_cap_ as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(std_ios_base),
            "::",
            stringify!(__parray_cap_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5imbueERKNS_6localeE"]
    pub fn std_ios_base_imbue(this: *mut std_ios_base, __loc: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt3__18ios_base6getlocEv"]
    pub fn std_ios_base_getloc(this: *const std_ios_base) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base6xallocEv"]
    pub fn std_ios_base_xalloc() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5iwordEi"]
    pub fn std_ios_base_iword(
        this: *mut std_ios_base,
        __index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5pwordEi"]
    pub fn std_ios_base_pword(
        this: *mut std_ios_base,
        __index: ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base17register_callbackEPFvNS0_5eventERS0_iEi"]
    pub fn std_ios_base_register_callback(
        this: *mut std_ios_base,
        __fn: std_ios_base_event_callback,
        __index: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base15sync_with_stdioEb"]
    pub fn std_ios_base_sync_with_stdio(__sync: bool) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base5clearEj"]
    pub fn std_ios_base_clear(this: *mut std_ios_base, __state: std_ios_base_iostate);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base33__set_badbit_and_consider_rethrowEv"]
    pub fn std_ios_base___set_badbit_and_consider_rethrow(this: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base34__set_failbit_and_consider_rethrowEv"]
    pub fn std_ios_base___set_failbit_and_consider_rethrow(this: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4initEPv"]
    pub fn std_ios_base_init(this: *mut std_ios_base, __sb: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base16__call_callbacksENS0_5eventE"]
    pub fn std_ios_base___call_callbacks(this: *mut std_ios_base, arg1: std_ios_base_event);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7copyfmtERKS0_"]
    pub fn std_ios_base_copyfmt(this: *mut std_ios_base, arg1: *const std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4moveERS0_"]
    pub fn std_ios_base_move(this: *mut std_ios_base, arg1: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4swapERS0_"]
    pub fn std_ios_base_swap(this: *mut std_ios_base, arg1: *mut std_ios_base);
}
impl std_ios_base {
    #[inline]
    pub unsafe fn flags(&self) -> std_ios_base_fmtflags {
        std_ios_base_flags(self)
    }
    #[inline]
    pub unsafe fn flags1(&mut self, __fmtfl: std_ios_base_fmtflags) -> std_ios_base_fmtflags {
        std_ios_base_flags1(self, __fmtfl)
    }
    #[inline]
    pub unsafe fn setf(&mut self, __fmtfl: std_ios_base_fmtflags) -> std_ios_base_fmtflags {
        std_ios_base_setf(self, __fmtfl)
    }
    #[inline]
    pub unsafe fn setf1(
        &mut self,
        __fmtfl: std_ios_base_fmtflags,
        __mask: std_ios_base_fmtflags,
    ) -> std_ios_base_fmtflags {
        std_ios_base_setf1(self, __fmtfl, __mask)
    }
    #[inline]
    pub unsafe fn unsetf(&mut self, __mask: std_ios_base_fmtflags) {
        std_ios_base_unsetf(self, __mask)
    }
    #[inline]
    pub unsafe fn precision(&self) -> std_streamsize {
        std_ios_base_precision(self)
    }
    #[inline]
    pub unsafe fn precision1(&mut self, __prec: std_streamsize) -> std_streamsize {
        std_ios_base_precision1(self, __prec)
    }
    #[inline]
    pub unsafe fn width(&self) -> std_streamsize {
        std_ios_base_width(self)
    }
    #[inline]
    pub unsafe fn width1(&mut self, __wide: std_streamsize) -> std_streamsize {
        std_ios_base_width1(self, __wide)
    }
    #[inline]
    pub unsafe fn imbue(&mut self, __loc: *const std_locale) -> std_locale {
        std_ios_base_imbue(self, __loc)
    }
    #[inline]
    pub unsafe fn getloc(&self) -> std_locale {
        std_ios_base_getloc(self)
    }
    #[inline]
    pub unsafe fn xalloc() -> ::std::os::raw::c_int {
        std_ios_base_xalloc()
    }
    #[inline]
    pub unsafe fn iword(&mut self, __index: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_long {
        std_ios_base_iword(self, __index)
    }
    #[inline]
    pub unsafe fn pword(
        &mut self,
        __index: ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_void {
        std_ios_base_pword(self, __index)
    }
    #[inline]
    pub unsafe fn register_callback(
        &mut self,
        __fn: std_ios_base_event_callback,
        __index: ::std::os::raw::c_int,
    ) {
        std_ios_base_register_callback(self, __fn, __index)
    }
    #[inline]
    pub unsafe fn sync_with_stdio(__sync: bool) -> bool {
        std_ios_base_sync_with_stdio(__sync)
    }
    #[inline]
    pub unsafe fn rdstate(&self) -> std_ios_base_iostate {
        std_ios_base_rdstate(self)
    }
    #[inline]
    pub unsafe fn clear(&mut self, __state: std_ios_base_iostate) {
        std_ios_base_clear(self, __state)
    }
    #[inline]
    pub unsafe fn setstate(&mut self, __state: std_ios_base_iostate) {
        std_ios_base_setstate(self, __state)
    }
    #[inline]
    pub unsafe fn good(&self) -> bool {
        std_ios_base_good(self)
    }
    #[inline]
    pub unsafe fn eof(&self) -> bool {
        std_ios_base_eof(self)
    }
    #[inline]
    pub unsafe fn fail(&self) -> bool {
        std_ios_base_fail(self)
    }
    #[inline]
    pub unsafe fn bad(&self) -> bool {
        std_ios_base_bad(self)
    }
    #[inline]
    pub unsafe fn exceptions(&self) -> std_ios_base_iostate {
        std_ios_base_exceptions(self)
    }
    #[inline]
    pub unsafe fn exceptions1(&mut self, __iostate: std_ios_base_iostate) {
        std_ios_base_exceptions1(self, __iostate)
    }
    #[inline]
    pub unsafe fn __set_badbit_and_consider_rethrow(&mut self) {
        std_ios_base___set_badbit_and_consider_rethrow(self)
    }
    #[inline]
    pub unsafe fn __set_failbit_and_consider_rethrow(&mut self) {
        std_ios_base___set_failbit_and_consider_rethrow(self)
    }
    #[inline]
    pub unsafe fn init(&mut self, __sb: *mut ::std::os::raw::c_void) {
        std_ios_base_init(self, __sb)
    }
    #[inline]
    pub unsafe fn __call_callbacks(&mut self, arg1: std_ios_base_event) {
        std_ios_base___call_callbacks(self, arg1)
    }
    #[inline]
    pub unsafe fn copyfmt(&mut self, arg1: *const std_ios_base) {
        std_ios_base_copyfmt(self, arg1)
    }
    #[inline]
    pub unsafe fn move_(&mut self, arg1: *mut std_ios_base) {
        std_ios_base_move(self, arg1)
    }
    #[inline]
    pub unsafe fn swap(&mut self, arg1: *mut std_ios_base) {
        std_ios_base_swap(self, arg1)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_baseD1Ev"]
    pub fn std_ios_base_ios_base_destructor(this: *mut std_ios_base);
}
#[test]
fn __bindgen_test_layout_std_atomic_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_atomic>(),
        4usize,
        concat!("Size of template specialization: ", stringify!(std_atomic))
    );
    assert_eq!(
        ::std::mem::align_of::<std_atomic>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_atomic)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base_failure {
    pub _base: std_system_error,
}
#[test]
fn bindgen_test_layout_std_ios_base_failure() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base_failure>(),
        32usize,
        concat!("Size of: ", stringify!(std_ios_base_failure))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base_failure>(),
        8usize,
        concat!("Alignment of ", stringify!(std_ios_base_failure))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7failureC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEERKNS_10error_codeE"]
    pub fn std_ios_base_failure_failure(
        this: *mut std_ios_base_failure,
        __msg: *const std_string,
        __ec: *const std_error_code,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7failureC1EPKcRKNS_10error_codeE"]
    pub fn std_ios_base_failure_failure1(
        this: *mut std_ios_base_failure,
        __msg: *const ::std::os::raw::c_char,
        __ec: *const std_error_code,
    );
}
impl std_ios_base_failure {
    #[inline]
    pub unsafe fn new(__msg: *const std_string, __ec: *const std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_ios_base_failure_failure(&mut __bindgen_tmp, __msg, __ec);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(__msg: *const ::std::os::raw::c_char, __ec: *const std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_ios_base_failure_failure1(&mut __bindgen_tmp, __msg, __ec);
        __bindgen_tmp
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base7failureD1Ev"]
    pub fn std_ios_base_failure_failure_destructor(this: *mut std_ios_base_failure);
}
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base_Init {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_ios_base_Init() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base_Init>(),
        1usize,
        concat!("Size of: ", stringify!(std_ios_base_Init))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base_Init>(),
        1usize,
        concat!("Alignment of ", stringify!(std_ios_base_Init))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4InitC1Ev"]
    pub fn std_ios_base_Init_Init(this: *mut std_ios_base_Init);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt3__18ios_base4InitD1Ev"]
    pub fn std_ios_base_Init_Init_destructor(this: *mut std_ios_base_Init);
}
impl std_ios_base_Init {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_ios_base_Init_Init(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_ios_base_Init_Init_destructor(self)
    }
}
#[repr(C)]
pub struct std_basic_ios {
    pub _base: std_ios_base,
    pub __tie_: *mut std_basic_ostream,
    pub __fill_: std_basic_ios_int_type,
}
pub type std_basic_ios_char_type<_CharT> = _CharT;
pub type std_basic_ios_traits_type<_Traits> = _Traits;
pub type std_basic_ios_int_type = [u8; 0usize];
pub type std_basic_ios_pos_type = [u8; 0usize];
pub type std_basic_ios_off_type = [u8; 0usize];
#[repr(C)]
pub struct std_basic_ostream {}
pub type std_basic_ostream_char_type<_CharT> = _CharT;
pub type std_basic_ostream_traits_type<_Traits> = _Traits;
pub type std_basic_ostream_int_type = [u8; 0usize];
pub type std_basic_ostream_pos_type = [u8; 0usize];
pub type std_basic_ostream_off_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_ostream_sentry {
    pub __ok_: bool,
    pub __os_: *mut std_basic_ostream,
}
#[repr(C)]
pub struct std_basic_istream {
    pub __gc_: std_streamsize,
}
pub type std_basic_istream_char_type<_CharT> = _CharT;
pub type std_basic_istream_traits_type<_Traits> = _Traits;
pub type std_basic_istream_int_type = [u8; 0usize];
pub type std_basic_istream_pos_type = [u8; 0usize];
pub type std_basic_istream_off_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istream_sentry {
    pub __ok_: bool,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_set {
    pub __tree_: std_set___base,
}
pub type std_set_key_type<_Key> = _Key;
pub type std_set_value_type<_Key> = std_set_key_type<_Key>;
pub type std_set_key_compare<_Compare> = _Compare;
pub type std_set_value_compare<_Compare> = std_set_key_compare<_Compare>;
pub type std_set_allocator_type<_Allocator> = _Allocator;
pub type std_set_reference<_Key> = *mut std_set_value_type<_Key>;
pub type std_set_const_reference<_Key> = *const std_set_value_type<_Key>;
pub type std_set___base = std___tree;
pub type std_set___alloc_traits = std_allocator_traits;
pub type std_set___node_holder = std_set___base;
pub type std_set_pointer = std_set___base;
pub type std_set_const_pointer = std_set___base;
pub type std_set_size_type = std_set___base;
pub type std_set_difference_type = std_set___base;
pub type std_set_iterator = std_set___base;
pub type std_set_const_iterator = std_set___base;
pub type std_set_reverse_iterator = std_reverse_iterator<std_set_iterator>;
pub type std_set_const_reverse_iterator = std_reverse_iterator<std_set_const_iterator>;
#[repr(C)]
pub struct std_exception__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_exception {
    pub vtable_: *const std_exception__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_std_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_exception>(),
        8usize,
        concat!("Size of: ", stringify!(std_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_exception>(),
        8usize,
        concat!("Alignment of ", stringify!(std_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt9exceptionD1Ev"]
    pub fn std_exception_exception_destructor(this: *mut std_exception);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt9exception4whatEv"]
    pub fn std_exception_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_exception_ptr {
    pub __ptr_: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_std_exception_ptr() {
    assert_eq!(
        ::std::mem::size_of::<std_exception_ptr>(),
        8usize,
        concat!("Size of: ", stringify!(std_exception_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<std_exception_ptr>(),
        8usize,
        concat!("Alignment of ", stringify!(std_exception_ptr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_exception_ptr>())).__ptr_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_exception_ptr),
            "::",
            stringify!(__ptr_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt13exception_ptrC1ERKS_"]
    pub fn std_exception_ptr_exception_ptr(
        this: *mut std_exception_ptr,
        arg1: *const std_exception_ptr,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt13exception_ptrD1Ev"]
    pub fn std_exception_ptr_exception_ptr_destructor(this: *mut std_exception_ptr);
}
impl std_exception_ptr {
    #[inline]
    pub unsafe fn new(arg1: *const std_exception_ptr) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_exception_ptr_exception_ptr(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_exception_ptr_exception_ptr_destructor(self)
    }
}
#[repr(C)]
pub struct std_type_info__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_type_info {
    pub vtable_: *const std_type_info__bindgen_vtable,
    pub __type_name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_std_type_info() {
    assert_eq!(
        ::std::mem::size_of::<std_type_info>(),
        16usize,
        concat!("Size of: ", stringify!(std_type_info))
    );
    assert_eq!(
        ::std::mem::align_of::<std_type_info>(),
        8usize,
        concat!("Alignment of ", stringify!(std_type_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_type_info>())).__type_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_type_info),
            "::",
            stringify!(__type_name)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt9type_infoD1Ev"]
    pub fn std_type_info_type_info_destructor(this: *mut std_type_info);
}
#[repr(C)]
#[derive(Debug)]
pub struct std_runtime_error {
    pub _base: std_exception,
    pub __imp_: std___libcpp_refstring,
}
#[test]
fn bindgen_test_layout_std_runtime_error() {
    assert_eq!(
        ::std::mem::size_of::<std_runtime_error>(),
        16usize,
        concat!("Size of: ", stringify!(std_runtime_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_runtime_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_runtime_error))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_runtime_error>())).__imp_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_runtime_error),
            "::",
            stringify!(__imp_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt13runtime_errorC1ERKNSt3__112basic_stringIcNS0_11char_traitsIcEENS0_9allocatorIcEEEE"]
    pub fn std_runtime_error_runtime_error(this: *mut std_runtime_error, arg1: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}__ZNSt13runtime_errorC1EPKc"]
    pub fn std_runtime_error_runtime_error1(
        this: *mut std_runtime_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNSt13runtime_errorC1ERKS_"]
    pub fn std_runtime_error_runtime_error2(
        this: *mut std_runtime_error,
        arg1: *const std_runtime_error,
    );
}
impl std_runtime_error {
    #[inline]
    pub unsafe fn new(arg1: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_runtime_error_runtime_error(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_runtime_error_runtime_error1(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new2(arg1: *const std_runtime_error) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_runtime_error_runtime_error2(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNSt13runtime_errorD1Ev"]
    pub fn std_runtime_error_runtime_error_destructor(this: *mut std_runtime_error);
}
extern "C" {
    #[link_name = "\u{1}__ZNKSt13runtime_error4whatEv"]
    pub fn std_runtime_error_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
pub type __darwin_intptr_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 16usize],
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__mbstate8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>()))._mbstateL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_cond_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_cond_t>())).__opaque as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_mutex_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_mutex_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type mbstate_t = __darwin_mbstate_t;
pub type pthread_cond_t = __darwin_pthread_cond_t;
pub type pthread_mutex_t = __darwin_pthread_mutex_t;
pub type google_protobuf_int32 = i32;
pub type google_protobuf_int64 = i64;
pub type google_protobuf_uint8 = u8;
pub type google_protobuf_uint32 = u32;
pub type google_protobuf_uint64 = u64;
pub type google_protobuf_internal_LifecycleId = i64;
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_internal_ArenaImpl {
    pub threads_: u64,
    pub hint_: u64,
    pub space_allocated_: std_atomic,
    pub initial_block_: *mut google_protobuf_internal_ArenaImpl_Block,
    pub lifecycle_id_: google_protobuf_internal_LifecycleId,
    pub options_: google_protobuf_internal_ArenaImpl_Options,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_ArenaImpl_Options {
    pub start_block_size: usize,
    pub max_block_size: usize,
    pub initial_block: *mut ::std::os::raw::c_char,
    pub initial_block_size: usize,
    pub block_alloc:
        ::std::option::Option<unsafe extern "C" fn(arg1: usize) -> *mut ::std::os::raw::c_void>,
    pub block_dealloc:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: usize)>,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_ArenaImpl_Options() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_ArenaImpl_Options>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_ArenaImpl_Options)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_ArenaImpl_Options>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_ArenaImpl_Options)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_Options>())).start_block_size
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_Options),
            "::",
            stringify!(start_block_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_Options>())).max_block_size
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_Options),
            "::",
            stringify!(max_block_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_Options>())).initial_block
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_Options),
            "::",
            stringify!(initial_block)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_Options>()))
                .initial_block_size as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_Options),
            "::",
            stringify!(initial_block_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_Options>())).block_alloc
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_Options),
            "::",
            stringify!(block_alloc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_Options>())).block_dealloc
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_Options),
            "::",
            stringify!(block_dealloc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_ArenaImpl_CleanupNode {
    pub elem: *mut ::std::os::raw::c_void,
    pub cleanup: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_ArenaImpl_CleanupNode() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_ArenaImpl_CleanupNode>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_ArenaImpl_CleanupNode)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_ArenaImpl_CleanupNode>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_ArenaImpl_CleanupNode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_CleanupNode>())).elem
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_CleanupNode),
            "::",
            stringify!(elem)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_CleanupNode>())).cleanup
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_CleanupNode),
            "::",
            stringify!(cleanup)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_ArenaImpl_CleanupChunk {
    pub size: usize,
    pub next: *mut google_protobuf_internal_ArenaImpl_CleanupChunk,
    pub nodes: [google_protobuf_internal_ArenaImpl_CleanupNode; 1usize],
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_ArenaImpl_CleanupChunk() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_ArenaImpl_CleanupChunk>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_ArenaImpl_CleanupChunk)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_ArenaImpl_CleanupChunk>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_ArenaImpl_CleanupChunk)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_CleanupChunk>())).size
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_CleanupChunk),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_CleanupChunk>())).next
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_CleanupChunk),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_CleanupChunk>())).nodes
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_CleanupChunk),
            "::",
            stringify!(nodes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_ArenaImpl_SerialArena {
    pub arena_: *mut google_protobuf_internal_ArenaImpl,
    pub owner_: *mut ::std::os::raw::c_void,
    pub head_: *mut google_protobuf_internal_ArenaImpl_Block,
    pub cleanup_: *mut google_protobuf_internal_ArenaImpl_CleanupChunk,
    pub next_: *mut google_protobuf_internal_ArenaImpl_SerialArena,
    pub ptr_: *mut ::std::os::raw::c_char,
    pub limit_: *mut ::std::os::raw::c_char,
    pub cleanup_ptr_: *mut google_protobuf_internal_ArenaImpl_CleanupNode,
    pub cleanup_limit_: *mut google_protobuf_internal_ArenaImpl_CleanupNode,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_ArenaImpl_SerialArena() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_ArenaImpl_SerialArena>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_ArenaImpl_SerialArena>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_SerialArena>())).arena_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena),
            "::",
            stringify!(arena_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_SerialArena>())).owner_
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena),
            "::",
            stringify!(owner_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_SerialArena>())).head_
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena),
            "::",
            stringify!(head_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_SerialArena>())).cleanup_
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena),
            "::",
            stringify!(cleanup_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_SerialArena>())).next_
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena),
            "::",
            stringify!(next_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_SerialArena>())).ptr_
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena),
            "::",
            stringify!(ptr_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_SerialArena>())).limit_
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena),
            "::",
            stringify!(limit_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_SerialArena>())).cleanup_ptr_
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena),
            "::",
            stringify!(cleanup_ptr_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_SerialArena>()))
                .cleanup_limit_ as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_SerialArena),
            "::",
            stringify!(cleanup_limit_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImpl11SerialArena3NewEPNS2_5BlockEPvPS2_"]
    pub fn google_protobuf_internal_ArenaImpl_SerialArena_New(
        b: *mut google_protobuf_internal_ArenaImpl_Block,
        owner: *mut ::std::os::raw::c_void,
        arena: *mut google_protobuf_internal_ArenaImpl,
    ) -> *mut google_protobuf_internal_ArenaImpl_SerialArena;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImpl11SerialArena4FreeEPS3_PNS2_5BlockEPFvPvmE"]
    pub fn google_protobuf_internal_ArenaImpl_SerialArena_Free(
        serial: *mut google_protobuf_internal_ArenaImpl_SerialArena,
        initial_block: *mut google_protobuf_internal_ArenaImpl_Block,
        block_dealloc: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: usize),
        >,
    ) -> google_protobuf_uint64;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImpl11SerialArena11CleanupListEv"]
    pub fn google_protobuf_internal_ArenaImpl_SerialArena_CleanupList(
        this: *mut google_protobuf_internal_ArenaImpl_SerialArena,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf8internal9ArenaImpl11SerialArena9SpaceUsedEv"]
    pub fn google_protobuf_internal_ArenaImpl_SerialArena_SpaceUsed(
        this: *const google_protobuf_internal_ArenaImpl_SerialArena,
    ) -> google_protobuf_uint64;
}
impl google_protobuf_internal_ArenaImpl_SerialArena {
    #[inline]
    pub unsafe fn New(
        b: *mut google_protobuf_internal_ArenaImpl_Block,
        owner: *mut ::std::os::raw::c_void,
        arena: *mut google_protobuf_internal_ArenaImpl,
    ) -> *mut google_protobuf_internal_ArenaImpl_SerialArena {
        google_protobuf_internal_ArenaImpl_SerialArena_New(b, owner, arena)
    }
    #[inline]
    pub unsafe fn Free(
        serial: *mut google_protobuf_internal_ArenaImpl_SerialArena,
        initial_block: *mut google_protobuf_internal_ArenaImpl_Block,
        block_dealloc: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: usize),
        >,
    ) -> google_protobuf_uint64 {
        google_protobuf_internal_ArenaImpl_SerialArena_Free(serial, initial_block, block_dealloc)
    }
    #[inline]
    pub unsafe fn CleanupList(&mut self) {
        google_protobuf_internal_ArenaImpl_SerialArena_CleanupList(self)
    }
    #[inline]
    pub unsafe fn SpaceUsed(&self) -> google_protobuf_uint64 {
        google_protobuf_internal_ArenaImpl_SerialArena_SpaceUsed(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_ArenaImpl_Block {
    pub next_: *mut google_protobuf_internal_ArenaImpl_Block,
    pub pos_: usize,
    pub size_: usize,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_ArenaImpl_Block() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_ArenaImpl_Block>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_ArenaImpl_Block)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_ArenaImpl_Block>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_ArenaImpl_Block)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_Block>())).next_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_Block),
            "::",
            stringify!(next_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_Block>())).pos_ as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_Block),
            "::",
            stringify!(pos_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_Block>())).size_ as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_Block),
            "::",
            stringify!(size_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImpl5BlockC1EmPS3_"]
    pub fn google_protobuf_internal_ArenaImpl_Block_Block(
        this: *mut google_protobuf_internal_ArenaImpl_Block,
        size: usize,
        next: *mut google_protobuf_internal_ArenaImpl_Block,
    );
}
impl google_protobuf_internal_ArenaImpl_Block {
    #[inline]
    pub unsafe fn new(size: usize, next: *mut google_protobuf_internal_ArenaImpl_Block) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        google_protobuf_internal_ArenaImpl_Block_Block(&mut __bindgen_tmp, size, next);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_ArenaImpl_ThreadCache {
    pub last_lifecycle_id_seen: google_protobuf_internal_LifecycleId,
    pub last_serial_arena: *mut google_protobuf_internal_ArenaImpl_SerialArena,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_ArenaImpl_ThreadCache() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_ArenaImpl_ThreadCache>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_ArenaImpl_ThreadCache)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_ArenaImpl_ThreadCache>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_ArenaImpl_ThreadCache)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_ThreadCache>()))
                .last_lifecycle_id_seen as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_ThreadCache),
            "::",
            stringify!(last_lifecycle_id_seen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl_ThreadCache>()))
                .last_serial_arena as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl_ThreadCache),
            "::",
            stringify!(last_serial_arena)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImpl23lifecycle_id_generator_E"]
    pub static mut google_protobuf_internal_ArenaImpl_lifecycle_id_generator_: std_atomic;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImpl13thread_cache_E"]
    pub static mut google_protobuf_internal_ArenaImpl_thread_cache_:
        google_protobuf_internal_ArenaImpl_ThreadCache;
}
pub const google_protobuf_internal_ArenaImpl_kBlockHeaderSize: usize = 24;
pub const google_protobuf_internal_ArenaImpl_kSerialArenaSize: usize = 72;
#[test]
fn bindgen_test_layout_google_protobuf_internal_ArenaImpl() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_ArenaImpl>(),
        88usize,
        concat!("Size of: ", stringify!(google_protobuf_internal_ArenaImpl))
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_ArenaImpl>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_ArenaImpl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl>())).threads_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl),
            "::",
            stringify!(threads_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl>())).hint_ as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl),
            "::",
            stringify!(hint_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl>())).space_allocated_
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl),
            "::",
            stringify!(space_allocated_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl>())).initial_block_
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl),
            "::",
            stringify!(initial_block_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl>())).lifecycle_id_ as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl),
            "::",
            stringify!(lifecycle_id_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaImpl>())).options_ as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaImpl),
            "::",
            stringify!(options_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImpl5ResetEv"]
    pub fn google_protobuf_internal_ArenaImpl_Reset(
        this: *mut google_protobuf_internal_ArenaImpl,
    ) -> google_protobuf_uint64;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf8internal9ArenaImpl14SpaceAllocatedEv"]
    pub fn google_protobuf_internal_ArenaImpl_SpaceAllocated(
        this: *const google_protobuf_internal_ArenaImpl,
    ) -> google_protobuf_uint64;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf8internal9ArenaImpl9SpaceUsedEv"]
    pub fn google_protobuf_internal_ArenaImpl_SpaceUsed(
        this: *const google_protobuf_internal_ArenaImpl,
    ) -> google_protobuf_uint64;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImpl15AllocateAlignedEm"]
    pub fn google_protobuf_internal_ArenaImpl_AllocateAligned(
        this: *mut google_protobuf_internal_ArenaImpl,
        n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImpl28AllocateAlignedAndAddCleanupEmPFvPvE"]
    pub fn google_protobuf_internal_ArenaImpl_AllocateAlignedAndAddCleanup(
        this: *mut google_protobuf_internal_ArenaImpl,
        n: usize,
        cleanup: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImpl10AddCleanupEPvPFvS3_E"]
    pub fn google_protobuf_internal_ArenaImpl_AddCleanup(
        this: *mut google_protobuf_internal_ArenaImpl,
        elem: *mut ::std::os::raw::c_void,
        cleanup: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal9ArenaImplD1Ev"]
    pub fn google_protobuf_internal_ArenaImpl_ArenaImpl_destructor(
        this: *mut google_protobuf_internal_ArenaImpl,
    );
}
impl google_protobuf_internal_ArenaImpl {
    #[inline]
    pub unsafe fn Reset(&mut self) -> google_protobuf_uint64 {
        google_protobuf_internal_ArenaImpl_Reset(self)
    }
    #[inline]
    pub unsafe fn SpaceAllocated(&self) -> google_protobuf_uint64 {
        google_protobuf_internal_ArenaImpl_SpaceAllocated(self)
    }
    #[inline]
    pub unsafe fn SpaceUsed(&self) -> google_protobuf_uint64 {
        google_protobuf_internal_ArenaImpl_SpaceUsed(self)
    }
    #[inline]
    pub unsafe fn AllocateAligned(&mut self, n: usize) -> *mut ::std::os::raw::c_void {
        google_protobuf_internal_ArenaImpl_AllocateAligned(self, n)
    }
    #[inline]
    pub unsafe fn AllocateAlignedAndAddCleanup(
        &mut self,
        n: usize,
        cleanup: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    ) -> *mut ::std::os::raw::c_void {
        google_protobuf_internal_ArenaImpl_AllocateAlignedAndAddCleanup(self, n, cleanup)
    }
    #[inline]
    pub unsafe fn AddCleanup(
        &mut self,
        elem: *mut ::std::os::raw::c_void,
        cleanup: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    ) {
        google_protobuf_internal_ArenaImpl_AddCleanup(self, elem, cleanup)
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        google_protobuf_internal_ArenaImpl_ArenaImpl_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_ArenaStringPtr {
    pub ptr_: *mut std_string,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_ArenaStringPtr() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_ArenaStringPtr>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_ArenaStringPtr)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_ArenaStringPtr>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_ArenaStringPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ArenaStringPtr>())).ptr_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ArenaStringPtr),
            "::",
            stringify!(ptr_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal14ArenaStringPtr17AssignWithDefaultEPKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEES2_"]
    pub fn google_protobuf_internal_ArenaStringPtr_AssignWithDefault(
        this: *mut google_protobuf_internal_ArenaStringPtr,
        default_value: *const std_string,
        value: google_protobuf_internal_ArenaStringPtr,
    );
}
impl google_protobuf_internal_ArenaStringPtr {
    #[inline]
    pub unsafe fn AssignWithDefault(
        &mut self,
        default_value: *const std_string,
        value: google_protobuf_internal_ArenaStringPtr,
    ) {
        google_protobuf_internal_ArenaStringPtr_AssignWithDefault(self, default_value, value)
    }
}
pub type google_protobuf_internal_once_flag = std_once_flag;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_IsMovable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_internal_RepeatedPtrFieldBase {
    pub arena_: *mut google_protobuf_Arena,
    pub current_size_: ::std::os::raw::c_int,
    pub total_size_: ::std::os::raw::c_int,
    pub rep_: *mut google_protobuf_internal_RepeatedPtrFieldBase_Rep,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_RepeatedPtrFieldBase_Rep {
    pub allocated_size: ::std::os::raw::c_int,
    pub elements: [*mut ::std::os::raw::c_void; 1usize],
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_RepeatedPtrFieldBase_Rep() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_RepeatedPtrFieldBase_Rep>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_RepeatedPtrFieldBase_Rep)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_RepeatedPtrFieldBase_Rep>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_RepeatedPtrFieldBase_Rep)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_RepeatedPtrFieldBase_Rep>()))
                .allocated_size as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_RepeatedPtrFieldBase_Rep),
            "::",
            stringify!(allocated_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_RepeatedPtrFieldBase_Rep>())).elements
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_RepeatedPtrFieldBase_Rep),
            "::",
            stringify!(elements)
        )
    );
}
pub const google_protobuf_internal_RepeatedPtrFieldBase_kInitialSize: ::std::os::raw::c_int = 0;
pub const google_protobuf_internal_RepeatedPtrFieldBase_kRepHeaderSize: usize = 8;
#[test]
fn bindgen_test_layout_google_protobuf_internal_RepeatedPtrFieldBase() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_RepeatedPtrFieldBase>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_RepeatedPtrFieldBase)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_RepeatedPtrFieldBase>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_RepeatedPtrFieldBase)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_RepeatedPtrFieldBase>())).arena_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_RepeatedPtrFieldBase),
            "::",
            stringify!(arena_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_RepeatedPtrFieldBase>())).current_size_
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_RepeatedPtrFieldBase),
            "::",
            stringify!(current_size_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_RepeatedPtrFieldBase>())).total_size_
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_RepeatedPtrFieldBase),
            "::",
            stringify!(total_size_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_RepeatedPtrFieldBase>())).rep_
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_RepeatedPtrFieldBase),
            "::",
            stringify!(rep_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf8internal20RepeatedPtrFieldBase5emptyEv"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_empty(
        this: *const google_protobuf_internal_RepeatedPtrFieldBase,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf8internal20RepeatedPtrFieldBase4sizeEv"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_size(
        this: *const google_protobuf_internal_RepeatedPtrFieldBase,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal20RepeatedPtrFieldBase7AddWeakEPKNS0_11MessageLiteE"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_AddWeak(
        this: *mut google_protobuf_internal_RepeatedPtrFieldBase,
        prototype: *const google_protobuf_MessageLite,
    ) -> *mut google_protobuf_MessageLite;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal20RepeatedPtrFieldBase8CloseGapEii"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_CloseGap(
        this: *mut google_protobuf_internal_RepeatedPtrFieldBase,
        start: ::std::os::raw::c_int,
        num: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal20RepeatedPtrFieldBase7ReserveEi"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_Reserve(
        this: *mut google_protobuf_internal_RepeatedPtrFieldBase,
        new_size: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf8internal20RepeatedPtrFieldBase8CapacityEv"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_Capacity(
        this: *const google_protobuf_internal_RepeatedPtrFieldBase,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf8internal20RepeatedPtrFieldBase8raw_dataEv"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_raw_data(
        this: *const google_protobuf_internal_RepeatedPtrFieldBase,
    ) -> *const *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf8internal20RepeatedPtrFieldBase16raw_mutable_dataEv"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_raw_mutable_data(
        this: *const google_protobuf_internal_RepeatedPtrFieldBase,
    ) -> *mut *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal20RepeatedPtrFieldBase12SwapElementsEii"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_SwapElements(
        this: *mut google_protobuf_internal_RepeatedPtrFieldBase,
        index1: ::std::os::raw::c_int,
        index2: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf8internal20RepeatedPtrFieldBase12ClearedCountEv"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_ClearedCount(
        this: *const google_protobuf_internal_RepeatedPtrFieldBase,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal20RepeatedPtrFieldBaseC1Ev"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_RepeatedPtrFieldBase(
        this: *mut google_protobuf_internal_RepeatedPtrFieldBase,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal20RepeatedPtrFieldBaseC1EPNS0_5ArenaE"]
    pub fn google_protobuf_internal_RepeatedPtrFieldBase_RepeatedPtrFieldBase1(
        this: *mut google_protobuf_internal_RepeatedPtrFieldBase,
        arena: *mut google_protobuf_Arena,
    );
}
impl google_protobuf_internal_RepeatedPtrFieldBase {
    #[inline]
    pub unsafe fn empty(&self) -> bool {
        google_protobuf_internal_RepeatedPtrFieldBase_empty(self)
    }
    #[inline]
    pub unsafe fn size(&self) -> ::std::os::raw::c_int {
        google_protobuf_internal_RepeatedPtrFieldBase_size(self)
    }
    #[inline]
    pub unsafe fn AddWeak(
        &mut self,
        prototype: *const google_protobuf_MessageLite,
    ) -> *mut google_protobuf_MessageLite {
        google_protobuf_internal_RepeatedPtrFieldBase_AddWeak(self, prototype)
    }
    #[inline]
    pub unsafe fn CloseGap(&mut self, start: ::std::os::raw::c_int, num: ::std::os::raw::c_int) {
        google_protobuf_internal_RepeatedPtrFieldBase_CloseGap(self, start, num)
    }
    #[inline]
    pub unsafe fn Reserve(&mut self, new_size: ::std::os::raw::c_int) {
        google_protobuf_internal_RepeatedPtrFieldBase_Reserve(self, new_size)
    }
    #[inline]
    pub unsafe fn Capacity(&self) -> ::std::os::raw::c_int {
        google_protobuf_internal_RepeatedPtrFieldBase_Capacity(self)
    }
    #[inline]
    pub unsafe fn raw_data(&self) -> *const *mut ::std::os::raw::c_void {
        google_protobuf_internal_RepeatedPtrFieldBase_raw_data(self)
    }
    #[inline]
    pub unsafe fn raw_mutable_data(&self) -> *mut *mut ::std::os::raw::c_void {
        google_protobuf_internal_RepeatedPtrFieldBase_raw_mutable_data(self)
    }
    #[inline]
    pub unsafe fn SwapElements(
        &mut self,
        index1: ::std::os::raw::c_int,
        index2: ::std::os::raw::c_int,
    ) {
        google_protobuf_internal_RepeatedPtrFieldBase_SwapElements(self, index1, index2)
    }
    #[inline]
    pub unsafe fn ClearedCount(&self) -> ::std::os::raw::c_int {
        google_protobuf_internal_RepeatedPtrFieldBase_ClearedCount(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        google_protobuf_internal_RepeatedPtrFieldBase_RepeatedPtrFieldBase(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(arena: *mut google_protobuf_Arena) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        google_protobuf_internal_RepeatedPtrFieldBase_RepeatedPtrFieldBase1(
            &mut __bindgen_tmp,
            arena,
        );
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_GenericTypeHandler {
    pub _address: u8,
}
pub type google_protobuf_internal_GenericTypeHandler_Type<GenericType> = GenericType;
pub type google_protobuf_internal_GenericTypeHandler_WeakType<GenericType> = GenericType;
pub type google_protobuf_internal_GenericTypeHandler_Movable = google_protobuf_internal_IsMovable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_RepeatedPtrIterator {
    pub it_: *const *mut ::std::os::raw::c_void,
}
pub type google_protobuf_internal_RepeatedPtrIterator_iterator =
    google_protobuf_internal_RepeatedPtrIterator;
pub type google_protobuf_internal_RepeatedPtrIterator_iterator_category =
    std_random_access_iterator_tag;
pub type google_protobuf_internal_RepeatedPtrIterator_value_type = std_remove_const;
pub type google_protobuf_internal_RepeatedPtrIterator_difference_type = isize;
pub type google_protobuf_internal_RepeatedPtrIterator_pointer<Element> = *mut Element;
pub type google_protobuf_internal_RepeatedPtrIterator_reference<Element> = *mut Element;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_RepeatedPtrOverPtrsIterator<VoidPtr> {
    pub it_: *mut VoidPtr,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<VoidPtr>>,
}
pub type google_protobuf_internal_RepeatedPtrOverPtrsIterator_iterator<VoidPtr> =
    google_protobuf_internal_RepeatedPtrOverPtrsIterator<VoidPtr>;
pub type google_protobuf_internal_RepeatedPtrOverPtrsIterator_iterator_category =
    std_random_access_iterator_tag;
pub type google_protobuf_internal_RepeatedPtrOverPtrsIterator_value_type = std_remove_const;
pub type google_protobuf_internal_RepeatedPtrOverPtrsIterator_difference_type = isize;
pub type google_protobuf_internal_RepeatedPtrOverPtrsIterator_pointer<Element> = *mut Element;
pub type google_protobuf_internal_RepeatedPtrOverPtrsIterator_reference<Element> = *mut Element;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_CachedSize {
    pub size_: std_atomic,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_CachedSize() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_CachedSize>(),
        4usize,
        concat!("Size of: ", stringify!(google_protobuf_internal_CachedSize))
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_CachedSize>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_CachedSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_CachedSize>())).size_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_CachedSize),
            "::",
            stringify!(size_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_SCCInfoBase {
    pub visit_status: std_atomic,
    pub num_deps: ::std::os::raw::c_int,
    pub init_func: ::std::option::Option<unsafe extern "C" fn()>,
}
pub const google_protobuf_internal_SCCInfoBase_kInitialized:
    google_protobuf_internal_SCCInfoBase__bindgen_ty_1 = 0;
pub const google_protobuf_internal_SCCInfoBase_kRunning:
    google_protobuf_internal_SCCInfoBase__bindgen_ty_1 = 1;
pub const google_protobuf_internal_SCCInfoBase_kUninitialized:
    google_protobuf_internal_SCCInfoBase__bindgen_ty_1 = -1;
pub type google_protobuf_internal_SCCInfoBase__bindgen_ty_1 = i32;
#[test]
fn bindgen_test_layout_google_protobuf_internal_SCCInfoBase() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_SCCInfoBase>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_SCCInfoBase)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_SCCInfoBase>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_SCCInfoBase)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_SCCInfoBase>())).visit_status
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_SCCInfoBase),
            "::",
            stringify!(visit_status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_SCCInfoBase>())).num_deps as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_SCCInfoBase),
            "::",
            stringify!(num_deps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_SCCInfoBase>())).init_func as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_SCCInfoBase),
            "::",
            stringify!(init_func)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_internal_InternalMetadataWithArenaBase {
    pub ptr_: *mut ::std::os::raw::c_void,
}
pub const google_protobuf_internal_InternalMetadataWithArenaBase_kTagArena:
    google_protobuf_internal_InternalMetadataWithArenaBase__bindgen_ty_1 = 0;
pub const google_protobuf_internal_InternalMetadataWithArenaBase_kTagContainer:
    google_protobuf_internal_InternalMetadataWithArenaBase__bindgen_ty_1 = 0;
pub type google_protobuf_internal_InternalMetadataWithArenaBase__bindgen_ty_1 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_InternalMetadataWithArenaBase_Container<T> {
    pub unknown_fields: T,
    pub arena: *mut google_protobuf_Arena,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
}
#[repr(C)]
pub struct google_protobuf_internal_InternalMetadataWithArena {
    pub _base: google_protobuf_internal_InternalMetadataWithArenaBase,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_InternalMetadataWithArena() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_InternalMetadataWithArena>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_InternalMetadataWithArena)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_InternalMetadataWithArena>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_InternalMetadataWithArena)
        )
    );
}
#[repr(C)]
pub struct google_protobuf_internal_WrappedMutex {
    pub mu_: std_mutex,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_WrappedMutex() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_WrappedMutex>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_WrappedMutex)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_WrappedMutex>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_WrappedMutex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_WrappedMutex>())).mu_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_WrappedMutex),
            "::",
            stringify!(mu_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_LazyDescriptor {
    pub descriptor_: *const google_protobuf_Descriptor,
    pub name_: *const std_string,
    pub once_: *mut google_protobuf_internal_once_flag,
    pub file_: *const google_protobuf_FileDescriptor,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_LazyDescriptor() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_LazyDescriptor>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_LazyDescriptor)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_LazyDescriptor>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_LazyDescriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_LazyDescriptor>())).descriptor_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_LazyDescriptor),
            "::",
            stringify!(descriptor_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_LazyDescriptor>())).name_ as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_LazyDescriptor),
            "::",
            stringify!(name_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_LazyDescriptor>())).once_ as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_LazyDescriptor),
            "::",
            stringify!(once_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_LazyDescriptor>())).file_ as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_LazyDescriptor),
            "::",
            stringify!(file_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal14LazyDescriptor3SetEPKNS0_10DescriptorE"]
    pub fn google_protobuf_internal_LazyDescriptor_Set(
        this: *mut google_protobuf_internal_LazyDescriptor,
        descriptor: *const google_protobuf_Descriptor,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf8internal14LazyDescriptor7SetLazyERKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEPKNS0_14FileDescriptorE"]
    pub fn google_protobuf_internal_LazyDescriptor_SetLazy(
        this: *mut google_protobuf_internal_LazyDescriptor,
        name: *const std_string,
        file: *const google_protobuf_FileDescriptor,
    );
}
impl google_protobuf_internal_LazyDescriptor {
    #[inline]
    pub unsafe fn Set(&mut self, descriptor: *const google_protobuf_Descriptor) {
        google_protobuf_internal_LazyDescriptor_Set(self, descriptor)
    }
    #[inline]
    pub unsafe fn SetLazy(
        &mut self,
        name: *const std_string,
        file: *const google_protobuf_FileDescriptor,
    ) {
        google_protobuf_internal_LazyDescriptor_SetLazy(self, name, file)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_ReflectionSchema {
    pub default_instance_: *const google_protobuf_Message,
    pub offsets_: *const google_protobuf_uint32,
    pub has_bit_indices_: *const google_protobuf_uint32,
    pub has_bits_offset_: ::std::os::raw::c_int,
    pub metadata_offset_: ::std::os::raw::c_int,
    pub extensions_offset_: ::std::os::raw::c_int,
    pub oneof_case_offset_: ::std::os::raw::c_int,
    pub object_size_: ::std::os::raw::c_int,
    pub weak_field_map_offset_: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_ReflectionSchema() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_ReflectionSchema>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_ReflectionSchema)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_ReflectionSchema>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_ReflectionSchema)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ReflectionSchema>())).default_instance_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ReflectionSchema),
            "::",
            stringify!(default_instance_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ReflectionSchema>())).offsets_
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ReflectionSchema),
            "::",
            stringify!(offsets_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ReflectionSchema>())).has_bit_indices_
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ReflectionSchema),
            "::",
            stringify!(has_bit_indices_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ReflectionSchema>())).has_bits_offset_
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ReflectionSchema),
            "::",
            stringify!(has_bits_offset_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ReflectionSchema>())).metadata_offset_
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ReflectionSchema),
            "::",
            stringify!(metadata_offset_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ReflectionSchema>())).extensions_offset_
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ReflectionSchema),
            "::",
            stringify!(extensions_offset_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ReflectionSchema>())).oneof_case_offset_
                as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ReflectionSchema),
            "::",
            stringify!(oneof_case_offset_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ReflectionSchema>())).object_size_
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ReflectionSchema),
            "::",
            stringify!(object_size_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_ReflectionSchema>()))
                .weak_field_map_offset_ as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_ReflectionSchema),
            "::",
            stringify!(weak_field_map_offset_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_MigrationSchema {
    pub offsets_index: google_protobuf_int32,
    pub has_bit_indices_index: google_protobuf_int32,
    pub object_size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_MigrationSchema() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_MigrationSchema>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_MigrationSchema)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_MigrationSchema>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_MigrationSchema)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_MigrationSchema>())).offsets_index
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_MigrationSchema),
            "::",
            stringify!(offsets_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_MigrationSchema>()))
                .has_bit_indices_index as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_MigrationSchema),
            "::",
            stringify!(has_bit_indices_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_MigrationSchema>())).object_size
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_MigrationSchema),
            "::",
            stringify!(object_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_internal_DescriptorTable {
    pub is_initialized: *mut bool,
    pub descriptor: *const ::std::os::raw::c_char,
    pub filename: *const ::std::os::raw::c_char,
    pub size: ::std::os::raw::c_int,
    pub once: *mut google_protobuf_internal_once_flag,
    pub init_default_instances: *const *mut google_protobuf_internal_SCCInfoBase,
    pub deps: *const *const google_protobuf_internal_DescriptorTable,
    pub num_sccs: ::std::os::raw::c_int,
    pub num_deps: ::std::os::raw::c_int,
    pub schemas: *const google_protobuf_internal_MigrationSchema,
    pub default_instances: *const *const google_protobuf_Message,
    pub offsets: *const google_protobuf_uint32,
    pub file_level_metadata: *mut google_protobuf_Metadata,
    pub num_messages: ::std::os::raw::c_int,
    pub file_level_enum_descriptors: *mut *const google_protobuf_EnumDescriptor,
    pub file_level_service_descriptors: *mut *const google_protobuf_ServiceDescriptor,
}
#[test]
fn bindgen_test_layout_google_protobuf_internal_DescriptorTable() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_internal_DescriptorTable>(),
        120usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_internal_DescriptorTable)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_internal_DescriptorTable>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_internal_DescriptorTable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).is_initialized
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).descriptor
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(descriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).filename
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).size as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).once as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(once)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>()))
                .init_default_instances as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(init_default_instances)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).deps as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(deps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).num_sccs
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(num_sccs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).num_deps
                as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(num_deps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).schemas as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(schemas)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).default_instances
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(default_instances)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).offsets as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(offsets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).file_level_metadata
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(file_level_metadata)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>())).num_messages
                as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(num_messages)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>()))
                .file_level_enum_descriptors as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(file_level_enum_descriptors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_internal_DescriptorTable>()))
                .file_level_service_descriptors as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_internal_DescriptorTable),
            "::",
            stringify!(file_level_service_descriptors)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_io_CodedInputStream {
    pub buffer_: *const google_protobuf_uint8,
    pub buffer_end_: *const google_protobuf_uint8,
    pub input_: *mut google_protobuf_io_ZeroCopyInputStream,
    pub total_bytes_read_: ::std::os::raw::c_int,
    pub overflow_bytes_: ::std::os::raw::c_int,
    pub last_tag_: google_protobuf_uint32,
    pub legitimate_message_end_: bool,
    pub aliasing_enabled_: bool,
    pub current_limit_: google_protobuf_io_CodedInputStream_Limit,
    pub buffer_size_after_limit_: ::std::os::raw::c_int,
    pub total_bytes_limit_: ::std::os::raw::c_int,
    pub recursion_budget_: ::std::os::raw::c_int,
    pub recursion_limit_: ::std::os::raw::c_int,
    pub extension_pool_: *const google_protobuf_DescriptorPool,
    pub extension_factory_: *mut google_protobuf_MessageFactory,
}
pub type google_protobuf_io_CodedInputStream_Limit = ::std::os::raw::c_int;
pub const google_protobuf_io_CodedInputStream_kDefaultTotalBytesLimit: ::std::os::raw::c_int =
    2147483647;
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream24default_recursion_limit_E"]
    pub static mut google_protobuf_io_CodedInputStream_default_recursion_limit_:
        ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_google_protobuf_io_CodedInputStream() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_io_CodedInputStream>(),
        80usize,
        concat!("Size of: ", stringify!(google_protobuf_io_CodedInputStream))
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_io_CodedInputStream>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_io_CodedInputStream)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).buffer_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(buffer_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).buffer_end_ as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(buffer_end_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).input_ as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(input_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).total_bytes_read_
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(total_bytes_read_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).overflow_bytes_
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(overflow_bytes_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).last_tag_ as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(last_tag_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).legitimate_message_end_
                as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(legitimate_message_end_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).aliasing_enabled_
                as *const _ as usize
        },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(aliasing_enabled_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).current_limit_
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(current_limit_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).buffer_size_after_limit_
                as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(buffer_size_after_limit_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).total_bytes_limit_
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(total_bytes_limit_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).recursion_budget_
                as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(recursion_budget_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).recursion_limit_
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(recursion_limit_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).extension_pool_
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(extension_pool_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedInputStream>())).extension_factory_
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedInputStream),
            "::",
            stringify!(extension_factory_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream22GetDirectBufferPointerEPPKvPi"]
    pub fn google_protobuf_io_CodedInputStream_GetDirectBufferPointer(
        this: *mut google_protobuf_io_CodedInputStream,
        data: *mut *const ::std::os::raw::c_void,
        size: *mut ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream28GetDirectBufferPointerInlineEPPKvPi"]
    pub fn google_protobuf_io_CodedInputStream_GetDirectBufferPointerInline(
        this: *mut google_protobuf_io_CodedInputStream,
        data: *mut *const ::std::os::raw::c_void,
        size: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream7ReadRawEPvi"]
    pub fn google_protobuf_io_CodedInputStream_ReadRaw(
        this: *mut google_protobuf_io_CodedInputStream,
        buffer: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream21InternalReadRawInlineEPvi"]
    pub fn google_protobuf_io_CodedInputStream_InternalReadRawInline(
        this: *mut google_protobuf_io_CodedInputStream,
        buffer: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream10ReadStringEPNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEi"]
    pub fn google_protobuf_io_CodedInputStream_ReadString(
        this: *mut google_protobuf_io_CodedInputStream,
        buffer: *mut std_string,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream24InternalReadStringInlineEPNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEi"]
    pub fn google_protobuf_io_CodedInputStream_InternalReadStringInline(
        this: *mut google_protobuf_io_CodedInputStream,
        buffer: *mut std_string,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream18ReadLittleEndian32EPj"]
    pub fn google_protobuf_io_CodedInputStream_ReadLittleEndian32(
        this: *mut google_protobuf_io_CodedInputStream,
        value: *mut google_protobuf_uint32,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream18ReadLittleEndian64EPy"]
    pub fn google_protobuf_io_CodedInputStream_ReadLittleEndian64(
        this: *mut google_protobuf_io_CodedInputStream,
        value: *mut google_protobuf_uint64,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream27ReadLittleEndian32FromArrayEPKhPj"]
    pub fn google_protobuf_io_CodedInputStream_ReadLittleEndian32FromArray(
        buffer: *const google_protobuf_uint8,
        value: *mut google_protobuf_uint32,
    ) -> *const google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream27ReadLittleEndian64FromArrayEPKhPy"]
    pub fn google_protobuf_io_CodedInputStream_ReadLittleEndian64FromArray(
        buffer: *const google_protobuf_uint8,
        value: *mut google_protobuf_uint64,
    ) -> *const google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream12ReadVarint32EPj"]
    pub fn google_protobuf_io_CodedInputStream_ReadVarint32(
        this: *mut google_protobuf_io_CodedInputStream,
        value: *mut google_protobuf_uint32,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream12ReadVarint64EPy"]
    pub fn google_protobuf_io_CodedInputStream_ReadVarint64(
        this: *mut google_protobuf_io_CodedInputStream,
        value: *mut google_protobuf_uint64,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream19ReadVarintSizeAsIntEPi"]
    pub fn google_protobuf_io_CodedInputStream_ReadVarintSizeAsInt(
        this: *mut google_protobuf_io_CodedInputStream,
        value: *mut ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream16ReadTagNoLastTagEv"]
    pub fn google_protobuf_io_CodedInputStream_ReadTagNoLastTag(
        this: *mut google_protobuf_io_CodedInputStream,
    ) -> google_protobuf_uint32;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream26ReadTagWithCutoffNoLastTagEj"]
    pub fn google_protobuf_io_CodedInputStream_ReadTagWithCutoffNoLastTag(
        this: *mut google_protobuf_io_CodedInputStream,
        cutoff: google_protobuf_uint32,
    ) -> std_pair<google_protobuf_uint32, bool>;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream9ExpectTagEj"]
    pub fn google_protobuf_io_CodedInputStream_ExpectTag(
        this: *mut google_protobuf_io_CodedInputStream,
        expected: google_protobuf_uint32,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream18ExpectTagFromArrayEPKhj"]
    pub fn google_protobuf_io_CodedInputStream_ExpectTagFromArray(
        buffer: *const google_protobuf_uint8,
        expected: google_protobuf_uint32,
    ) -> *const google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream11ExpectAtEndEv"]
    pub fn google_protobuf_io_CodedInputStream_ExpectAtEnd(
        this: *mut google_protobuf_io_CodedInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream10LastTagWasEj"]
    pub fn google_protobuf_io_CodedInputStream_LastTagWas(
        this: *mut google_protobuf_io_CodedInputStream,
        expected: google_protobuf_uint32,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream21ConsumedEntireMessageEv"]
    pub fn google_protobuf_io_CodedInputStream_ConsumedEntireMessage(
        this: *mut google_protobuf_io_CodedInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream9PushLimitEi"]
    pub fn google_protobuf_io_CodedInputStream_PushLimit(
        this: *mut google_protobuf_io_CodedInputStream,
        byte_limit: ::std::os::raw::c_int,
    ) -> google_protobuf_io_CodedInputStream_Limit;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream8PopLimitEi"]
    pub fn google_protobuf_io_CodedInputStream_PopLimit(
        this: *mut google_protobuf_io_CodedInputStream,
        limit: google_protobuf_io_CodedInputStream_Limit,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf2io16CodedInputStream15BytesUntilLimitEv"]
    pub fn google_protobuf_io_CodedInputStream_BytesUntilLimit(
        this: *const google_protobuf_io_CodedInputStream,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf2io16CodedInputStream15CurrentPositionEv"]
    pub fn google_protobuf_io_CodedInputStream_CurrentPosition(
        this: *const google_protobuf_io_CodedInputStream,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream18SetTotalBytesLimitEi"]
    pub fn google_protobuf_io_CodedInputStream_SetTotalBytesLimit(
        this: *mut google_protobuf_io_CodedInputStream,
        total_bytes_limit: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf2io16CodedInputStream25BytesUntilTotalBytesLimitEv"]
    pub fn google_protobuf_io_CodedInputStream_BytesUntilTotalBytesLimit(
        this: *const google_protobuf_io_CodedInputStream,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream17SetRecursionLimitEi"]
    pub fn google_protobuf_io_CodedInputStream_SetRecursionLimit(
        this: *mut google_protobuf_io_CodedInputStream,
        limit: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream23IncrementRecursionDepthEv"]
    pub fn google_protobuf_io_CodedInputStream_IncrementRecursionDepth(
        this: *mut google_protobuf_io_CodedInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream23DecrementRecursionDepthEv"]
    pub fn google_protobuf_io_CodedInputStream_DecrementRecursionDepth(
        this: *mut google_protobuf_io_CodedInputStream,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream29UnsafeDecrementRecursionDepthEv"]
    pub fn google_protobuf_io_CodedInputStream_UnsafeDecrementRecursionDepth(
        this: *mut google_protobuf_io_CodedInputStream,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream35IncrementRecursionDepthAndPushLimitEi"]
    pub fn google_protobuf_io_CodedInputStream_IncrementRecursionDepthAndPushLimit(
        this: *mut google_protobuf_io_CodedInputStream,
        byte_limit: ::std::os::raw::c_int,
    ) -> std_pair<google_protobuf_io_CodedInputStream_Limit, ::std::os::raw::c_int>;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream22ReadLengthAndPushLimitEv"]
    pub fn google_protobuf_io_CodedInputStream_ReadLengthAndPushLimit(
        this: *mut google_protobuf_io_CodedInputStream,
    ) -> google_protobuf_io_CodedInputStream_Limit;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream34DecrementRecursionDepthAndPopLimitEi"]
    pub fn google_protobuf_io_CodedInputStream_DecrementRecursionDepthAndPopLimit(
        this: *mut google_protobuf_io_CodedInputStream,
        limit: google_protobuf_io_CodedInputStream_Limit,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream37CheckEntireMessageConsumedAndPopLimitEi"]
    pub fn google_protobuf_io_CodedInputStream_CheckEntireMessageConsumedAndPopLimit(
        this: *mut google_protobuf_io_CodedInputStream,
        limit: google_protobuf_io_CodedInputStream_Limit,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream20SetExtensionRegistryEPKNS0_14DescriptorPoolEPNS0_14MessageFactoryE"]
    pub fn google_protobuf_io_CodedInputStream_SetExtensionRegistry(
        this: *mut google_protobuf_io_CodedInputStream,
        pool: *const google_protobuf_DescriptorPool,
        factory: *mut google_protobuf_MessageFactory,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream16GetExtensionPoolEv"]
    pub fn google_protobuf_io_CodedInputStream_GetExtensionPool(
        this: *mut google_protobuf_io_CodedInputStream,
    ) -> *const google_protobuf_DescriptorPool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStream19GetExtensionFactoryEv"]
    pub fn google_protobuf_io_CodedInputStream_GetExtensionFactory(
        this: *mut google_protobuf_io_CodedInputStream,
    ) -> *mut google_protobuf_MessageFactory;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStreamC1EPNS1_19ZeroCopyInputStreamE"]
    pub fn google_protobuf_io_CodedInputStream_CodedInputStream(
        this: *mut google_protobuf_io_CodedInputStream,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStreamC1EPKhi"]
    pub fn google_protobuf_io_CodedInputStream_CodedInputStream1(
        this: *mut google_protobuf_io_CodedInputStream,
        buffer: *const google_protobuf_uint8,
        size: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io16CodedInputStreamD1Ev"]
    pub fn google_protobuf_io_CodedInputStream_CodedInputStream_destructor(
        this: *mut google_protobuf_io_CodedInputStream,
    );
}
impl google_protobuf_io_CodedInputStream {
    #[inline]
    pub unsafe fn GetDirectBufferPointer(
        &mut self,
        data: *mut *const ::std::os::raw::c_void,
        size: *mut ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_io_CodedInputStream_GetDirectBufferPointer(self, data, size)
    }
    #[inline]
    pub unsafe fn GetDirectBufferPointerInline(
        &mut self,
        data: *mut *const ::std::os::raw::c_void,
        size: *mut ::std::os::raw::c_int,
    ) {
        google_protobuf_io_CodedInputStream_GetDirectBufferPointerInline(self, data, size)
    }
    #[inline]
    pub unsafe fn ReadRaw(
        &mut self,
        buffer: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_io_CodedInputStream_ReadRaw(self, buffer, size)
    }
    #[inline]
    pub unsafe fn InternalReadRawInline(
        &mut self,
        buffer: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_io_CodedInputStream_InternalReadRawInline(self, buffer, size)
    }
    #[inline]
    pub unsafe fn ReadString(
        &mut self,
        buffer: *mut std_string,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_io_CodedInputStream_ReadString(self, buffer, size)
    }
    #[inline]
    pub unsafe fn InternalReadStringInline(
        &mut self,
        buffer: *mut std_string,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_io_CodedInputStream_InternalReadStringInline(self, buffer, size)
    }
    #[inline]
    pub unsafe fn ReadLittleEndian32(&mut self, value: *mut google_protobuf_uint32) -> bool {
        google_protobuf_io_CodedInputStream_ReadLittleEndian32(self, value)
    }
    #[inline]
    pub unsafe fn ReadLittleEndian64(&mut self, value: *mut google_protobuf_uint64) -> bool {
        google_protobuf_io_CodedInputStream_ReadLittleEndian64(self, value)
    }
    #[inline]
    pub unsafe fn ReadLittleEndian32FromArray(
        buffer: *const google_protobuf_uint8,
        value: *mut google_protobuf_uint32,
    ) -> *const google_protobuf_uint8 {
        google_protobuf_io_CodedInputStream_ReadLittleEndian32FromArray(buffer, value)
    }
    #[inline]
    pub unsafe fn ReadLittleEndian64FromArray(
        buffer: *const google_protobuf_uint8,
        value: *mut google_protobuf_uint64,
    ) -> *const google_protobuf_uint8 {
        google_protobuf_io_CodedInputStream_ReadLittleEndian64FromArray(buffer, value)
    }
    #[inline]
    pub unsafe fn ReadVarint32(&mut self, value: *mut google_protobuf_uint32) -> bool {
        google_protobuf_io_CodedInputStream_ReadVarint32(self, value)
    }
    #[inline]
    pub unsafe fn ReadVarint64(&mut self, value: *mut google_protobuf_uint64) -> bool {
        google_protobuf_io_CodedInputStream_ReadVarint64(self, value)
    }
    #[inline]
    pub unsafe fn ReadVarintSizeAsInt(&mut self, value: *mut ::std::os::raw::c_int) -> bool {
        google_protobuf_io_CodedInputStream_ReadVarintSizeAsInt(self, value)
    }
    #[inline]
    pub unsafe fn ReadTagNoLastTag(&mut self) -> google_protobuf_uint32 {
        google_protobuf_io_CodedInputStream_ReadTagNoLastTag(self)
    }
    #[inline]
    pub unsafe fn ReadTagWithCutoffNoLastTag(
        &mut self,
        cutoff: google_protobuf_uint32,
    ) -> std_pair<google_protobuf_uint32, bool> {
        google_protobuf_io_CodedInputStream_ReadTagWithCutoffNoLastTag(self, cutoff)
    }
    #[inline]
    pub unsafe fn ExpectTag(&mut self, expected: google_protobuf_uint32) -> bool {
        google_protobuf_io_CodedInputStream_ExpectTag(self, expected)
    }
    #[inline]
    pub unsafe fn ExpectTagFromArray(
        buffer: *const google_protobuf_uint8,
        expected: google_protobuf_uint32,
    ) -> *const google_protobuf_uint8 {
        google_protobuf_io_CodedInputStream_ExpectTagFromArray(buffer, expected)
    }
    #[inline]
    pub unsafe fn ExpectAtEnd(&mut self) -> bool {
        google_protobuf_io_CodedInputStream_ExpectAtEnd(self)
    }
    #[inline]
    pub unsafe fn LastTagWas(&mut self, expected: google_protobuf_uint32) -> bool {
        google_protobuf_io_CodedInputStream_LastTagWas(self, expected)
    }
    #[inline]
    pub unsafe fn ConsumedEntireMessage(&mut self) -> bool {
        google_protobuf_io_CodedInputStream_ConsumedEntireMessage(self)
    }
    #[inline]
    pub unsafe fn PushLimit(
        &mut self,
        byte_limit: ::std::os::raw::c_int,
    ) -> google_protobuf_io_CodedInputStream_Limit {
        google_protobuf_io_CodedInputStream_PushLimit(self, byte_limit)
    }
    #[inline]
    pub unsafe fn PopLimit(&mut self, limit: google_protobuf_io_CodedInputStream_Limit) {
        google_protobuf_io_CodedInputStream_PopLimit(self, limit)
    }
    #[inline]
    pub unsafe fn BytesUntilLimit(&self) -> ::std::os::raw::c_int {
        google_protobuf_io_CodedInputStream_BytesUntilLimit(self)
    }
    #[inline]
    pub unsafe fn CurrentPosition(&self) -> ::std::os::raw::c_int {
        google_protobuf_io_CodedInputStream_CurrentPosition(self)
    }
    #[inline]
    pub unsafe fn SetTotalBytesLimit(&mut self, total_bytes_limit: ::std::os::raw::c_int) {
        google_protobuf_io_CodedInputStream_SetTotalBytesLimit(self, total_bytes_limit)
    }
    #[inline]
    pub unsafe fn BytesUntilTotalBytesLimit(&self) -> ::std::os::raw::c_int {
        google_protobuf_io_CodedInputStream_BytesUntilTotalBytesLimit(self)
    }
    #[inline]
    pub unsafe fn SetRecursionLimit(&mut self, limit: ::std::os::raw::c_int) {
        google_protobuf_io_CodedInputStream_SetRecursionLimit(self, limit)
    }
    #[inline]
    pub unsafe fn IncrementRecursionDepth(&mut self) -> bool {
        google_protobuf_io_CodedInputStream_IncrementRecursionDepth(self)
    }
    #[inline]
    pub unsafe fn DecrementRecursionDepth(&mut self) {
        google_protobuf_io_CodedInputStream_DecrementRecursionDepth(self)
    }
    #[inline]
    pub unsafe fn UnsafeDecrementRecursionDepth(&mut self) {
        google_protobuf_io_CodedInputStream_UnsafeDecrementRecursionDepth(self)
    }
    #[inline]
    pub unsafe fn IncrementRecursionDepthAndPushLimit(
        &mut self,
        byte_limit: ::std::os::raw::c_int,
    ) -> std_pair<google_protobuf_io_CodedInputStream_Limit, ::std::os::raw::c_int> {
        google_protobuf_io_CodedInputStream_IncrementRecursionDepthAndPushLimit(self, byte_limit)
    }
    #[inline]
    pub unsafe fn ReadLengthAndPushLimit(&mut self) -> google_protobuf_io_CodedInputStream_Limit {
        google_protobuf_io_CodedInputStream_ReadLengthAndPushLimit(self)
    }
    #[inline]
    pub unsafe fn DecrementRecursionDepthAndPopLimit(
        &mut self,
        limit: google_protobuf_io_CodedInputStream_Limit,
    ) -> bool {
        google_protobuf_io_CodedInputStream_DecrementRecursionDepthAndPopLimit(self, limit)
    }
    #[inline]
    pub unsafe fn CheckEntireMessageConsumedAndPopLimit(
        &mut self,
        limit: google_protobuf_io_CodedInputStream_Limit,
    ) -> bool {
        google_protobuf_io_CodedInputStream_CheckEntireMessageConsumedAndPopLimit(self, limit)
    }
    #[inline]
    pub unsafe fn SetExtensionRegistry(
        &mut self,
        pool: *const google_protobuf_DescriptorPool,
        factory: *mut google_protobuf_MessageFactory,
    ) {
        google_protobuf_io_CodedInputStream_SetExtensionRegistry(self, pool, factory)
    }
    #[inline]
    pub unsafe fn GetExtensionPool(&mut self) -> *const google_protobuf_DescriptorPool {
        google_protobuf_io_CodedInputStream_GetExtensionPool(self)
    }
    #[inline]
    pub unsafe fn GetExtensionFactory(&mut self) -> *mut google_protobuf_MessageFactory {
        google_protobuf_io_CodedInputStream_GetExtensionFactory(self)
    }
    #[inline]
    pub unsafe fn new(input: *mut google_protobuf_io_ZeroCopyInputStream) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        google_protobuf_io_CodedInputStream_CodedInputStream(&mut __bindgen_tmp, input);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(buffer: *const google_protobuf_uint8, size: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        google_protobuf_io_CodedInputStream_CodedInputStream1(&mut __bindgen_tmp, buffer, size);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        google_protobuf_io_CodedInputStream_CodedInputStream_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_io_CodedOutputStream {
    pub output_: *mut google_protobuf_io_ZeroCopyOutputStream,
    pub buffer_: *mut google_protobuf_uint8,
    pub buffer_size_: ::std::os::raw::c_int,
    pub total_bytes_: ::std::os::raw::c_int,
    pub had_error_: bool,
    pub aliasing_enabled_: bool,
    pub is_serialization_deterministic_: bool,
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream36default_serialization_deterministic_E"]
    pub static mut google_protobuf_io_CodedOutputStream_default_serialization_deterministic_:
        std_atomic;
}
#[test]
fn bindgen_test_layout_google_protobuf_io_CodedOutputStream() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_io_CodedOutputStream>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_io_CodedOutputStream)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_io_CodedOutputStream>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_io_CodedOutputStream)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedOutputStream>())).output_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedOutputStream),
            "::",
            stringify!(output_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedOutputStream>())).buffer_ as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedOutputStream),
            "::",
            stringify!(buffer_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedOutputStream>())).buffer_size_
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedOutputStream),
            "::",
            stringify!(buffer_size_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedOutputStream>())).total_bytes_
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedOutputStream),
            "::",
            stringify!(total_bytes_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedOutputStream>())).had_error_ as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedOutputStream),
            "::",
            stringify!(had_error_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedOutputStream>())).aliasing_enabled_
                as *const _ as usize
        },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedOutputStream),
            "::",
            stringify!(aliasing_enabled_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_io_CodedOutputStream>()))
                .is_serialization_deterministic_ as *const _ as usize
        },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_io_CodedOutputStream),
            "::",
            stringify!(is_serialization_deterministic_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream4TrimEv"]
    pub fn google_protobuf_io_CodedOutputStream_Trim(
        this: *mut google_protobuf_io_CodedOutputStream,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream4SkipEi"]
    pub fn google_protobuf_io_CodedOutputStream_Skip(
        this: *mut google_protobuf_io_CodedOutputStream,
        count: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream22GetDirectBufferPointerEPPvPi"]
    pub fn google_protobuf_io_CodedOutputStream_GetDirectBufferPointer(
        this: *mut google_protobuf_io_CodedOutputStream,
        data: *mut *mut ::std::os::raw::c_void,
        size: *mut ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream8WriteRawEPKvi"]
    pub fn google_protobuf_io_CodedOutputStream_WriteRaw(
        this: *mut google_protobuf_io_CodedOutputStream,
        buffer: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream20WriteRawMaybeAliasedEPKvi"]
    pub fn google_protobuf_io_CodedOutputStream_WriteRawMaybeAliased(
        this: *mut google_protobuf_io_CodedOutputStream,
        data: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream15WriteRawToArrayEPKviPh"]
    pub fn google_protobuf_io_CodedOutputStream_WriteRawToArray(
        buffer: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream11WriteStringERKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEE"]
    pub fn google_protobuf_io_CodedOutputStream_WriteString(
        this: *mut google_protobuf_io_CodedOutputStream,
        str: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream18WriteStringToArrayERKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEPh"]
    pub fn google_protobuf_io_CodedOutputStream_WriteStringToArray(
        str: *const std_string,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream26WriteStringWithSizeToArrayERKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEPh"]
    pub fn google_protobuf_io_CodedOutputStream_WriteStringWithSizeToArray(
        str: *const std_string,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream14EnableAliasingEb"]
    pub fn google_protobuf_io_CodedOutputStream_EnableAliasing(
        this: *mut google_protobuf_io_CodedOutputStream,
        enabled: bool,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream19WriteLittleEndian32Ej"]
    pub fn google_protobuf_io_CodedOutputStream_WriteLittleEndian32(
        this: *mut google_protobuf_io_CodedOutputStream,
        value: google_protobuf_uint32,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream26WriteLittleEndian32ToArrayEjPh"]
    pub fn google_protobuf_io_CodedOutputStream_WriteLittleEndian32ToArray(
        value: google_protobuf_uint32,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream19WriteLittleEndian64Ey"]
    pub fn google_protobuf_io_CodedOutputStream_WriteLittleEndian64(
        this: *mut google_protobuf_io_CodedOutputStream,
        value: google_protobuf_uint64,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream26WriteLittleEndian64ToArrayEyPh"]
    pub fn google_protobuf_io_CodedOutputStream_WriteLittleEndian64ToArray(
        value: google_protobuf_uint64,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream13WriteVarint32Ej"]
    pub fn google_protobuf_io_CodedOutputStream_WriteVarint32(
        this: *mut google_protobuf_io_CodedOutputStream,
        value: google_protobuf_uint32,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream20WriteVarint32ToArrayEjPh"]
    pub fn google_protobuf_io_CodedOutputStream_WriteVarint32ToArray(
        value: google_protobuf_uint32,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream13WriteVarint64Ey"]
    pub fn google_protobuf_io_CodedOutputStream_WriteVarint64(
        this: *mut google_protobuf_io_CodedOutputStream,
        value: google_protobuf_uint64,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream20WriteVarint64ToArrayEyPh"]
    pub fn google_protobuf_io_CodedOutputStream_WriteVarint64ToArray(
        value: google_protobuf_uint64,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream25WriteVarint32SignExtendedEi"]
    pub fn google_protobuf_io_CodedOutputStream_WriteVarint32SignExtended(
        this: *mut google_protobuf_io_CodedOutputStream,
        value: google_protobuf_int32,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream32WriteVarint32SignExtendedToArrayEiPh"]
    pub fn google_protobuf_io_CodedOutputStream_WriteVarint32SignExtendedToArray(
        value: google_protobuf_int32,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream8WriteTagEj"]
    pub fn google_protobuf_io_CodedOutputStream_WriteTag(
        this: *mut google_protobuf_io_CodedOutputStream,
        value: google_protobuf_uint32,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream15WriteTagToArrayEjPh"]
    pub fn google_protobuf_io_CodedOutputStream_WriteTagToArray(
        value: google_protobuf_uint32,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream12VarintSize32Ej"]
    pub fn google_protobuf_io_CodedOutputStream_VarintSize32(
        value: google_protobuf_uint32,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream12VarintSize64Ey"]
    pub fn google_protobuf_io_CodedOutputStream_VarintSize64(
        value: google_protobuf_uint64,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStream24VarintSize32SignExtendedEi"]
    pub fn google_protobuf_io_CodedOutputStream_VarintSize32SignExtended(
        value: google_protobuf_int32,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStreamC1EPNS1_20ZeroCopyOutputStreamE"]
    pub fn google_protobuf_io_CodedOutputStream_CodedOutputStream(
        this: *mut google_protobuf_io_CodedOutputStream,
        output: *mut google_protobuf_io_ZeroCopyOutputStream,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStreamC1EPNS1_20ZeroCopyOutputStreamEb"]
    pub fn google_protobuf_io_CodedOutputStream_CodedOutputStream1(
        this: *mut google_protobuf_io_CodedOutputStream,
        output: *mut google_protobuf_io_ZeroCopyOutputStream,
        do_eager_refresh: bool,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io17CodedOutputStreamD1Ev"]
    pub fn google_protobuf_io_CodedOutputStream_CodedOutputStream_destructor(
        this: *mut google_protobuf_io_CodedOutputStream,
    );
}
impl google_protobuf_io_CodedOutputStream {
    #[inline]
    pub unsafe fn Trim(&mut self) {
        google_protobuf_io_CodedOutputStream_Trim(self)
    }
    #[inline]
    pub unsafe fn Skip(&mut self, count: ::std::os::raw::c_int) -> bool {
        google_protobuf_io_CodedOutputStream_Skip(self, count)
    }
    #[inline]
    pub unsafe fn GetDirectBufferPointer(
        &mut self,
        data: *mut *mut ::std::os::raw::c_void,
        size: *mut ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_io_CodedOutputStream_GetDirectBufferPointer(self, data, size)
    }
    #[inline]
    pub unsafe fn WriteRaw(
        &mut self,
        buffer: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) {
        google_protobuf_io_CodedOutputStream_WriteRaw(self, buffer, size)
    }
    #[inline]
    pub unsafe fn WriteRawMaybeAliased(
        &mut self,
        data: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) {
        google_protobuf_io_CodedOutputStream_WriteRawMaybeAliased(self, data, size)
    }
    #[inline]
    pub unsafe fn WriteRawToArray(
        buffer: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8 {
        google_protobuf_io_CodedOutputStream_WriteRawToArray(buffer, size, target)
    }
    #[inline]
    pub unsafe fn WriteString(&mut self, str: *const std_string) {
        google_protobuf_io_CodedOutputStream_WriteString(self, str)
    }
    #[inline]
    pub unsafe fn WriteStringToArray(
        str: *const std_string,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8 {
        google_protobuf_io_CodedOutputStream_WriteStringToArray(str, target)
    }
    #[inline]
    pub unsafe fn WriteStringWithSizeToArray(
        str: *const std_string,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8 {
        google_protobuf_io_CodedOutputStream_WriteStringWithSizeToArray(str, target)
    }
    #[inline]
    pub unsafe fn EnableAliasing(&mut self, enabled: bool) {
        google_protobuf_io_CodedOutputStream_EnableAliasing(self, enabled)
    }
    #[inline]
    pub unsafe fn WriteLittleEndian32(&mut self, value: google_protobuf_uint32) {
        google_protobuf_io_CodedOutputStream_WriteLittleEndian32(self, value)
    }
    #[inline]
    pub unsafe fn WriteLittleEndian32ToArray(
        value: google_protobuf_uint32,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8 {
        google_protobuf_io_CodedOutputStream_WriteLittleEndian32ToArray(value, target)
    }
    #[inline]
    pub unsafe fn WriteLittleEndian64(&mut self, value: google_protobuf_uint64) {
        google_protobuf_io_CodedOutputStream_WriteLittleEndian64(self, value)
    }
    #[inline]
    pub unsafe fn WriteLittleEndian64ToArray(
        value: google_protobuf_uint64,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8 {
        google_protobuf_io_CodedOutputStream_WriteLittleEndian64ToArray(value, target)
    }
    #[inline]
    pub unsafe fn WriteVarint32(&mut self, value: google_protobuf_uint32) {
        google_protobuf_io_CodedOutputStream_WriteVarint32(self, value)
    }
    #[inline]
    pub unsafe fn WriteVarint32ToArray(
        value: google_protobuf_uint32,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8 {
        google_protobuf_io_CodedOutputStream_WriteVarint32ToArray(value, target)
    }
    #[inline]
    pub unsafe fn WriteVarint64(&mut self, value: google_protobuf_uint64) {
        google_protobuf_io_CodedOutputStream_WriteVarint64(self, value)
    }
    #[inline]
    pub unsafe fn WriteVarint64ToArray(
        value: google_protobuf_uint64,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8 {
        google_protobuf_io_CodedOutputStream_WriteVarint64ToArray(value, target)
    }
    #[inline]
    pub unsafe fn WriteVarint32SignExtended(&mut self, value: google_protobuf_int32) {
        google_protobuf_io_CodedOutputStream_WriteVarint32SignExtended(self, value)
    }
    #[inline]
    pub unsafe fn WriteVarint32SignExtendedToArray(
        value: google_protobuf_int32,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8 {
        google_protobuf_io_CodedOutputStream_WriteVarint32SignExtendedToArray(value, target)
    }
    #[inline]
    pub unsafe fn WriteTag(&mut self, value: google_protobuf_uint32) {
        google_protobuf_io_CodedOutputStream_WriteTag(self, value)
    }
    #[inline]
    pub unsafe fn WriteTagToArray(
        value: google_protobuf_uint32,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8 {
        google_protobuf_io_CodedOutputStream_WriteTagToArray(value, target)
    }
    #[inline]
    pub unsafe fn VarintSize32(value: google_protobuf_uint32) -> usize {
        google_protobuf_io_CodedOutputStream_VarintSize32(value)
    }
    #[inline]
    pub unsafe fn VarintSize64(value: google_protobuf_uint64) -> usize {
        google_protobuf_io_CodedOutputStream_VarintSize64(value)
    }
    #[inline]
    pub unsafe fn VarintSize32SignExtended(value: google_protobuf_int32) -> usize {
        google_protobuf_io_CodedOutputStream_VarintSize32SignExtended(value)
    }
    #[inline]
    pub unsafe fn new(output: *mut google_protobuf_io_ZeroCopyOutputStream) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        google_protobuf_io_CodedOutputStream_CodedOutputStream(&mut __bindgen_tmp, output);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(
        output: *mut google_protobuf_io_ZeroCopyOutputStream,
        do_eager_refresh: bool,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        google_protobuf_io_CodedOutputStream_CodedOutputStream1(
            &mut __bindgen_tmp,
            output,
            do_eager_refresh,
        );
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        google_protobuf_io_CodedOutputStream_CodedOutputStream_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static google_protobuf_io_CodedOutputStream_StaticVarintSize32_value: usize;
}
#[test]
fn __bindgen_test_layout_std_atomic_open0_bool__close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std_atomic>(),
        1usize,
        concat!("Size of template specialization: ", stringify!(std_atomic))
    );
    assert_eq!(
        ::std::mem::align_of::<std_atomic>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std_atomic)
        )
    );
}
#[repr(C)]
pub struct google_protobuf_io_ZeroCopyInputStream__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_io_ZeroCopyInputStream {
    pub vtable_: *const google_protobuf_io_ZeroCopyInputStream__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_google_protobuf_io_ZeroCopyInputStream() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_io_ZeroCopyInputStream>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_io_ZeroCopyInputStream)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_io_ZeroCopyInputStream>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_io_ZeroCopyInputStream)
        )
    );
}
#[repr(C)]
pub struct google_protobuf_io_ZeroCopyOutputStream__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_io_ZeroCopyOutputStream {
    pub vtable_: *const google_protobuf_io_ZeroCopyOutputStream__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_google_protobuf_io_ZeroCopyOutputStream() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_io_ZeroCopyOutputStream>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_io_ZeroCopyOutputStream)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_io_ZeroCopyOutputStream>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_io_ZeroCopyOutputStream)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"]
    pub fn google_protobuf_io_ZeroCopyOutputStream_WriteAliasedRaw(
        this: *mut ::std::os::raw::c_void,
        data: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_Arena {
    pub impl_: google_protobuf_internal_ArenaImpl,
    pub on_arena_allocation_: ::std::option::Option<
        unsafe extern "C" fn(
            allocated_type: *const std_type_info,
            alloc_size: google_protobuf_uint64,
            cookie: *mut ::std::os::raw::c_void,
        ),
    >,
    pub on_arena_reset_: ::std::option::Option<
        unsafe extern "C" fn(
            arena: *mut google_protobuf_Arena,
            cookie: *mut ::std::os::raw::c_void,
            space_used: google_protobuf_uint64,
        ),
    >,
    pub on_arena_destruction_: ::std::option::Option<
        unsafe extern "C" fn(
            arena: *mut google_protobuf_Arena,
            cookie: *mut ::std::os::raw::c_void,
            space_used: google_protobuf_uint64,
        ),
    >,
    pub hooks_cookie_: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_Arena_InternalHelper {
    pub _address: u8,
}
pub type google_protobuf_Arena_InternalHelper_is_destructor_skippable = u8;
pub type google_protobuf_Arena_InternalHelper_is_arena_constructable = u8;
pub type google_protobuf_Arena_InternalHelper_has_get_arena = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_Arena_is_arena_constructable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_Arena_is_destructor_skippable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_Arena_has_get_arena {
    pub _address: u8,
}
pub const google_protobuf_Arena_kBlockOverhead: usize = 96;
#[test]
fn bindgen_test_layout_google_protobuf_Arena() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_Arena>(),
        120usize,
        concat!("Size of: ", stringify!(google_protobuf_Arena))
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_Arena>(),
        8usize,
        concat!("Alignment of ", stringify!(google_protobuf_Arena))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<google_protobuf_Arena>())).impl_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Arena),
            "::",
            stringify!(impl_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Arena>())).on_arena_allocation_ as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Arena),
            "::",
            stringify!(on_arena_allocation_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Arena>())).on_arena_reset_ as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Arena),
            "::",
            stringify!(on_arena_reset_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Arena>())).on_arena_destruction_ as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Arena),
            "::",
            stringify!(on_arena_destruction_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Arena>())).hooks_cookie_ as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Arena),
            "::",
            stringify!(hooks_cookie_)
        )
    );
}
#[repr(C)]
pub struct google_protobuf_MessageLite__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_MessageLite {
    pub vtable_: *const google_protobuf_MessageLite__bindgen_vtable,
}
pub const google_protobuf_MessageLite_ParseFlags_kMerge: google_protobuf_MessageLite_ParseFlags = 0;
pub const google_protobuf_MessageLite_ParseFlags_kParse: google_protobuf_MessageLite_ParseFlags = 1;
pub const google_protobuf_MessageLite_ParseFlags_kMergePartial:
    google_protobuf_MessageLite_ParseFlags = 2;
pub const google_protobuf_MessageLite_ParseFlags_kParsePartial:
    google_protobuf_MessageLite_ParseFlags = 3;
pub const google_protobuf_MessageLite_ParseFlags_kMergeWithAliasing:
    google_protobuf_MessageLite_ParseFlags = 4;
pub const google_protobuf_MessageLite_ParseFlags_kParseWithAliasing:
    google_protobuf_MessageLite_ParseFlags = 5;
pub const google_protobuf_MessageLite_ParseFlags_kMergePartialWithAliasing:
    google_protobuf_MessageLite_ParseFlags = 6;
pub const google_protobuf_MessageLite_ParseFlags_kParsePartialWithAliasing:
    google_protobuf_MessageLite_ParseFlags = 7;
pub type google_protobuf_MessageLite_ParseFlags = u32;
#[test]
fn bindgen_test_layout_google_protobuf_MessageLite() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_MessageLite>(),
        8usize,
        concat!("Size of: ", stringify!(google_protobuf_MessageLite))
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_MessageLite>(),
        8usize,
        concat!("Alignment of ", stringify!(google_protobuf_MessageLite))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite11DebugStringEv"]
    pub fn google_protobuf_MessageLite_DebugString(
        this: *const google_protobuf_MessageLite,
    ) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite20ParseFromCodedStreamEPNS0_2io16CodedInputStreamE"]
    pub fn google_protobuf_MessageLite_ParseFromCodedStream(
        this: *mut google_protobuf_MessageLite,
        input: *mut google_protobuf_io_CodedInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite27ParsePartialFromCodedStreamEPNS0_2io16CodedInputStreamE"]
    pub fn google_protobuf_MessageLite_ParsePartialFromCodedStream(
        this: *mut google_protobuf_MessageLite,
        input: *mut google_protobuf_io_CodedInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite23ParseFromZeroCopyStreamEPNS0_2io19ZeroCopyInputStreamE"]
    pub fn google_protobuf_MessageLite_ParseFromZeroCopyStream(
        this: *mut google_protobuf_MessageLite,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite30ParsePartialFromZeroCopyStreamEPNS0_2io19ZeroCopyInputStreamE"]
    pub fn google_protobuf_MessageLite_ParsePartialFromZeroCopyStream(
        this: *mut google_protobuf_MessageLite,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite23ParseFromFileDescriptorEi"]
    pub fn google_protobuf_MessageLite_ParseFromFileDescriptor(
        this: *mut google_protobuf_MessageLite,
        file_descriptor: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite30ParsePartialFromFileDescriptorEi"]
    pub fn google_protobuf_MessageLite_ParsePartialFromFileDescriptor(
        this: *mut google_protobuf_MessageLite,
        file_descriptor: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite16ParseFromIstreamEPNSt3__113basic_istreamIcNS2_11char_traitsIcEEEE"]
    pub fn google_protobuf_MessageLite_ParseFromIstream(
        this: *mut google_protobuf_MessageLite,
        input: *mut std_istream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite23ParsePartialFromIstreamEPNSt3__113basic_istreamIcNS2_11char_traitsIcEEEE"]
    pub fn google_protobuf_MessageLite_ParsePartialFromIstream(
        this: *mut google_protobuf_MessageLite,
        input: *mut std_istream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite37MergePartialFromBoundedZeroCopyStreamEPNS0_2io19ZeroCopyInputStreamEi"]
    pub fn google_protobuf_MessageLite_MergePartialFromBoundedZeroCopyStream(
        this: *mut google_protobuf_MessageLite,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite30MergeFromBoundedZeroCopyStreamEPNS0_2io19ZeroCopyInputStreamEi"]
    pub fn google_protobuf_MessageLite_MergeFromBoundedZeroCopyStream(
        this: *mut google_protobuf_MessageLite,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite30ParseFromBoundedZeroCopyStreamEPNS0_2io19ZeroCopyInputStreamEi"]
    pub fn google_protobuf_MessageLite_ParseFromBoundedZeroCopyStream(
        this: *mut google_protobuf_MessageLite,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite37ParsePartialFromBoundedZeroCopyStreamEPNS0_2io19ZeroCopyInputStreamEi"]
    pub fn google_protobuf_MessageLite_ParsePartialFromBoundedZeroCopyStream(
        this: *mut google_protobuf_MessageLite,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite15ParseFromStringERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_MessageLite_ParseFromString(
        this: *mut google_protobuf_MessageLite,
        data: *const std_string,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite22ParsePartialFromStringERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_MessageLite_ParsePartialFromString(
        this: *mut google_protobuf_MessageLite,
        data: *const std_string,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite14ParseFromArrayEPKvi"]
    pub fn google_protobuf_MessageLite_ParseFromArray(
        this: *mut google_protobuf_MessageLite,
        data: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite21ParsePartialFromArrayEPKvi"]
    pub fn google_protobuf_MessageLite_ParsePartialFromArray(
        this: *mut google_protobuf_MessageLite,
        data: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite20MergeFromCodedStreamEPNS0_2io16CodedInputStreamE"]
    pub fn google_protobuf_MessageLite_MergeFromCodedStream(
        this: *mut google_protobuf_MessageLite,
        input: *mut google_protobuf_io_CodedInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf11MessageLite15MergeFromStringERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_MessageLite_MergeFromString(
        this: *mut google_protobuf_MessageLite,
        data: *const std_string,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite22SerializeToCodedStreamEPNS0_2io17CodedOutputStreamE"]
    pub fn google_protobuf_MessageLite_SerializeToCodedStream(
        this: *const google_protobuf_MessageLite,
        output: *mut google_protobuf_io_CodedOutputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite29SerializePartialToCodedStreamEPNS0_2io17CodedOutputStreamE"]
    pub fn google_protobuf_MessageLite_SerializePartialToCodedStream(
        this: *const google_protobuf_MessageLite,
        output: *mut google_protobuf_io_CodedOutputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite25SerializeToZeroCopyStreamEPNS0_2io20ZeroCopyOutputStreamE"]
    pub fn google_protobuf_MessageLite_SerializeToZeroCopyStream(
        this: *const google_protobuf_MessageLite,
        output: *mut google_protobuf_io_ZeroCopyOutputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite32SerializePartialToZeroCopyStreamEPNS0_2io20ZeroCopyOutputStreamE"]
    pub fn google_protobuf_MessageLite_SerializePartialToZeroCopyStream(
        this: *const google_protobuf_MessageLite,
        output: *mut google_protobuf_io_ZeroCopyOutputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite17SerializeToStringEPNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_MessageLite_SerializeToString(
        this: *const google_protobuf_MessageLite,
        output: *mut std_string,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite24SerializePartialToStringEPNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_MessageLite_SerializePartialToString(
        this: *const google_protobuf_MessageLite,
        output: *mut std_string,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite16SerializeToArrayEPvi"]
    pub fn google_protobuf_MessageLite_SerializeToArray(
        this: *const google_protobuf_MessageLite,
        data: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite23SerializePartialToArrayEPvi"]
    pub fn google_protobuf_MessageLite_SerializePartialToArray(
        this: *const google_protobuf_MessageLite,
        data: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite17SerializeAsStringEv"]
    pub fn google_protobuf_MessageLite_SerializeAsString(
        this: *const google_protobuf_MessageLite,
    ) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite24SerializePartialAsStringEv"]
    pub fn google_protobuf_MessageLite_SerializePartialAsString(
        this: *const google_protobuf_MessageLite,
    ) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite25SerializeToFileDescriptorEi"]
    pub fn google_protobuf_MessageLite_SerializeToFileDescriptor(
        this: *const google_protobuf_MessageLite,
        file_descriptor: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite32SerializePartialToFileDescriptorEi"]
    pub fn google_protobuf_MessageLite_SerializePartialToFileDescriptor(
        this: *const google_protobuf_MessageLite,
        file_descriptor: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite18SerializeToOstreamEPNSt3__113basic_ostreamIcNS2_11char_traitsIcEEEE"]
    pub fn google_protobuf_MessageLite_SerializeToOstream(
        this: *const google_protobuf_MessageLite,
        output: *mut std_ostream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite25SerializePartialToOstreamEPNSt3__113basic_ostreamIcNS2_11char_traitsIcEEEE"]
    pub fn google_protobuf_MessageLite_SerializePartialToOstream(
        this: *const google_protobuf_MessageLite,
        output: *mut std_ostream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite14AppendToStringEPNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_MessageLite_AppendToString(
        this: *const google_protobuf_MessageLite,
        output: *mut std_string,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite21AppendPartialToStringEPNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_MessageLite_AppendPartialToString(
        this: *const google_protobuf_MessageLite,
        output: *mut std_string,
    ) -> bool;
}
impl google_protobuf_MessageLite {
    #[inline]
    pub unsafe fn DebugString(&self) -> std_string {
        google_protobuf_MessageLite_DebugString(self)
    }
    #[inline]
    pub unsafe fn ParseFromCodedStream(
        &mut self,
        input: *mut google_protobuf_io_CodedInputStream,
    ) -> bool {
        google_protobuf_MessageLite_ParseFromCodedStream(self, input)
    }
    #[inline]
    pub unsafe fn ParsePartialFromCodedStream(
        &mut self,
        input: *mut google_protobuf_io_CodedInputStream,
    ) -> bool {
        google_protobuf_MessageLite_ParsePartialFromCodedStream(self, input)
    }
    #[inline]
    pub unsafe fn ParseFromZeroCopyStream(
        &mut self,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
    ) -> bool {
        google_protobuf_MessageLite_ParseFromZeroCopyStream(self, input)
    }
    #[inline]
    pub unsafe fn ParsePartialFromZeroCopyStream(
        &mut self,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
    ) -> bool {
        google_protobuf_MessageLite_ParsePartialFromZeroCopyStream(self, input)
    }
    #[inline]
    pub unsafe fn ParseFromFileDescriptor(
        &mut self,
        file_descriptor: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_ParseFromFileDescriptor(self, file_descriptor)
    }
    #[inline]
    pub unsafe fn ParsePartialFromFileDescriptor(
        &mut self,
        file_descriptor: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_ParsePartialFromFileDescriptor(self, file_descriptor)
    }
    #[inline]
    pub unsafe fn ParseFromIstream(&mut self, input: *mut std_istream) -> bool {
        google_protobuf_MessageLite_ParseFromIstream(self, input)
    }
    #[inline]
    pub unsafe fn ParsePartialFromIstream(&mut self, input: *mut std_istream) -> bool {
        google_protobuf_MessageLite_ParsePartialFromIstream(self, input)
    }
    #[inline]
    pub unsafe fn MergePartialFromBoundedZeroCopyStream(
        &mut self,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_MergePartialFromBoundedZeroCopyStream(self, input, size)
    }
    #[inline]
    pub unsafe fn MergeFromBoundedZeroCopyStream(
        &mut self,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_MergeFromBoundedZeroCopyStream(self, input, size)
    }
    #[inline]
    pub unsafe fn ParseFromBoundedZeroCopyStream(
        &mut self,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_ParseFromBoundedZeroCopyStream(self, input, size)
    }
    #[inline]
    pub unsafe fn ParsePartialFromBoundedZeroCopyStream(
        &mut self,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_ParsePartialFromBoundedZeroCopyStream(self, input, size)
    }
    #[inline]
    pub unsafe fn ParseFromString(&mut self, data: *const std_string) -> bool {
        google_protobuf_MessageLite_ParseFromString(self, data)
    }
    #[inline]
    pub unsafe fn ParsePartialFromString(&mut self, data: *const std_string) -> bool {
        google_protobuf_MessageLite_ParsePartialFromString(self, data)
    }
    #[inline]
    pub unsafe fn ParseFromArray(
        &mut self,
        data: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_ParseFromArray(self, data, size)
    }
    #[inline]
    pub unsafe fn ParsePartialFromArray(
        &mut self,
        data: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_ParsePartialFromArray(self, data, size)
    }
    #[inline]
    pub unsafe fn MergeFromCodedStream(
        &mut self,
        input: *mut google_protobuf_io_CodedInputStream,
    ) -> bool {
        google_protobuf_MessageLite_MergeFromCodedStream(self, input)
    }
    #[inline]
    pub unsafe fn MergeFromString(&mut self, data: *const std_string) -> bool {
        google_protobuf_MessageLite_MergeFromString(self, data)
    }
    #[inline]
    pub unsafe fn SerializeToCodedStream(
        &self,
        output: *mut google_protobuf_io_CodedOutputStream,
    ) -> bool {
        google_protobuf_MessageLite_SerializeToCodedStream(self, output)
    }
    #[inline]
    pub unsafe fn SerializePartialToCodedStream(
        &self,
        output: *mut google_protobuf_io_CodedOutputStream,
    ) -> bool {
        google_protobuf_MessageLite_SerializePartialToCodedStream(self, output)
    }
    #[inline]
    pub unsafe fn SerializeToZeroCopyStream(
        &self,
        output: *mut google_protobuf_io_ZeroCopyOutputStream,
    ) -> bool {
        google_protobuf_MessageLite_SerializeToZeroCopyStream(self, output)
    }
    #[inline]
    pub unsafe fn SerializePartialToZeroCopyStream(
        &self,
        output: *mut google_protobuf_io_ZeroCopyOutputStream,
    ) -> bool {
        google_protobuf_MessageLite_SerializePartialToZeroCopyStream(self, output)
    }
    #[inline]
    pub unsafe fn SerializeToString(&self, output: *mut std_string) -> bool {
        google_protobuf_MessageLite_SerializeToString(self, output)
    }
    #[inline]
    pub unsafe fn SerializePartialToString(&self, output: *mut std_string) -> bool {
        google_protobuf_MessageLite_SerializePartialToString(self, output)
    }
    #[inline]
    pub unsafe fn SerializeToArray(
        &self,
        data: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_SerializeToArray(self, data, size)
    }
    #[inline]
    pub unsafe fn SerializePartialToArray(
        &self,
        data: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_SerializePartialToArray(self, data, size)
    }
    #[inline]
    pub unsafe fn SerializeAsString(&self) -> std_string {
        google_protobuf_MessageLite_SerializeAsString(self)
    }
    #[inline]
    pub unsafe fn SerializePartialAsString(&self) -> std_string {
        google_protobuf_MessageLite_SerializePartialAsString(self)
    }
    #[inline]
    pub unsafe fn SerializeToFileDescriptor(&self, file_descriptor: ::std::os::raw::c_int) -> bool {
        google_protobuf_MessageLite_SerializeToFileDescriptor(self, file_descriptor)
    }
    #[inline]
    pub unsafe fn SerializePartialToFileDescriptor(
        &self,
        file_descriptor: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_MessageLite_SerializePartialToFileDescriptor(self, file_descriptor)
    }
    #[inline]
    pub unsafe fn SerializeToOstream(&self, output: *mut std_ostream) -> bool {
        google_protobuf_MessageLite_SerializeToOstream(self, output)
    }
    #[inline]
    pub unsafe fn SerializePartialToOstream(&self, output: *mut std_ostream) -> bool {
        google_protobuf_MessageLite_SerializePartialToOstream(self, output)
    }
    #[inline]
    pub unsafe fn AppendToString(&self, output: *mut std_string) -> bool {
        google_protobuf_MessageLite_AppendToString(self, output)
    }
    #[inline]
    pub unsafe fn AppendPartialToString(&self, output: *mut std_string) -> bool {
        google_protobuf_MessageLite_AppendPartialToString(self, output)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite3NewEPNS0_5ArenaE"]
    pub fn google_protobuf_MessageLite_New1(
        this: *mut ::std::os::raw::c_void,
        arena: *mut google_protobuf_Arena,
    ) -> *mut google_protobuf_MessageLite;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite25InitializationErrorStringEv"]
    pub fn google_protobuf_MessageLite_InitializationErrorString(
        this: *mut ::std::os::raw::c_void,
    ) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite24SerializeWithCachedSizesEPNS0_2io17CodedOutputStreamE"]
    pub fn google_protobuf_MessageLite_SerializeWithCachedSizes(
        this: *mut ::std::os::raw::c_void,
        output: *mut google_protobuf_io_CodedOutputStream,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite31SerializeWithCachedSizesToArrayEPh"]
    pub fn google_protobuf_MessageLite_SerializeWithCachedSizesToArray(
        this: *mut ::std::os::raw::c_void,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf11MessageLite39InternalSerializeWithCachedSizesToArrayEPh"]
    pub fn google_protobuf_MessageLite_InternalSerializeWithCachedSizesToArray(
        this: *mut ::std::os::raw::c_void,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_RepeatedField {
    pub current_size_: ::std::os::raw::c_int,
    pub total_size_: ::std::os::raw::c_int,
    pub arena_or_elements_: *mut ::std::os::raw::c_void,
}
pub type google_protobuf_RepeatedField_iterator<Element> = *mut Element;
pub type google_protobuf_RepeatedField_const_iterator<Element> = *const Element;
pub type google_protobuf_RepeatedField_value_type<Element> = Element;
pub type google_protobuf_RepeatedField_reference<Element> =
    *mut google_protobuf_RepeatedField_value_type<Element>;
pub type google_protobuf_RepeatedField_const_reference<Element> =
    *const google_protobuf_RepeatedField_value_type<Element>;
pub type google_protobuf_RepeatedField_pointer<Element> =
    *mut google_protobuf_RepeatedField_value_type<Element>;
pub type google_protobuf_RepeatedField_const_pointer<Element> =
    *const google_protobuf_RepeatedField_value_type<Element>;
pub type google_protobuf_RepeatedField_size_type = ::std::os::raw::c_int;
pub type google_protobuf_RepeatedField_difference_type = isize;
pub type google_protobuf_RepeatedField_const_reverse_iterator<Element> =
    std_reverse_iterator<google_protobuf_RepeatedField_const_iterator<Element>>;
pub type google_protobuf_RepeatedField_reverse_iterator<Element> =
    std_reverse_iterator<google_protobuf_RepeatedField_iterator<Element>>;
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_RepeatedField_Rep<Element> {
    pub arena: *mut google_protobuf_Arena,
    pub elements: [Element; 1usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Element>>,
}
pub type google_protobuf_RepeatedField_InternalArenaConstructable_ = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug)]
pub struct google_protobuf_RepeatedPtrField {
    pub _base: google_protobuf_internal_RepeatedPtrFieldBase,
}
pub type google_protobuf_RepeatedPtrField_iterator = google_protobuf_internal_RepeatedPtrIterator;
pub type google_protobuf_RepeatedPtrField_const_iterator =
    google_protobuf_internal_RepeatedPtrIterator;
pub type google_protobuf_RepeatedPtrField_value_type<Element> = Element;
pub type google_protobuf_RepeatedPtrField_reference<Element> =
    *mut google_protobuf_RepeatedPtrField_value_type<Element>;
pub type google_protobuf_RepeatedPtrField_const_reference<Element> =
    *const google_protobuf_RepeatedPtrField_value_type<Element>;
pub type google_protobuf_RepeatedPtrField_pointer<Element> =
    *mut google_protobuf_RepeatedPtrField_value_type<Element>;
pub type google_protobuf_RepeatedPtrField_const_pointer<Element> =
    *const google_protobuf_RepeatedPtrField_value_type<Element>;
pub type google_protobuf_RepeatedPtrField_size_type = ::std::os::raw::c_int;
pub type google_protobuf_RepeatedPtrField_difference_type = isize;
pub type google_protobuf_RepeatedPtrField_const_reverse_iterator =
    std_reverse_iterator<google_protobuf_RepeatedPtrField_const_iterator>;
pub type google_protobuf_RepeatedPtrField_reverse_iterator =
    std_reverse_iterator<google_protobuf_RepeatedPtrField_iterator>;
pub type google_protobuf_RepeatedPtrField_pointer_iterator =
    google_protobuf_internal_RepeatedPtrOverPtrsIterator<VoidPtr>;
pub type google_protobuf_RepeatedPtrField_const_pointer_iterator =
    google_protobuf_internal_RepeatedPtrOverPtrsIterator<VoidPtr>;
pub type google_protobuf_RepeatedPtrField_InternalArenaConstructable_ = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_RepeatedPtrField_TypeHandler {
    pub _address: u8,
}
#[repr(C)]
pub struct google_protobuf_UnknownFieldSet {
    pub fields_: std_vector,
}
#[test]
fn bindgen_test_layout_google_protobuf_UnknownFieldSet() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_UnknownFieldSet>(),
        24usize,
        concat!("Size of: ", stringify!(google_protobuf_UnknownFieldSet))
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_UnknownFieldSet>(),
        8usize,
        concat!("Alignment of ", stringify!(google_protobuf_UnknownFieldSet))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_UnknownFieldSet>())).fields_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_UnknownFieldSet),
            "::",
            stringify!(fields_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet18ClearAndFreeMemoryEv"]
    pub fn google_protobuf_UnknownFieldSet_ClearAndFreeMemory(
        this: *mut google_protobuf_UnknownFieldSet,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet9MergeFromERKS1_"]
    pub fn google_protobuf_UnknownFieldSet_MergeFrom(
        this: *mut google_protobuf_UnknownFieldSet,
        other: *const google_protobuf_UnknownFieldSet,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet19MergeFromAndDestroyEPS1_"]
    pub fn google_protobuf_UnknownFieldSet_MergeFromAndDestroy(
        this: *mut google_protobuf_UnknownFieldSet,
        other: *mut google_protobuf_UnknownFieldSet,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet22MergeToInternalMetdataERKS1_PNS0_8internal25InternalMetadataWithArenaE"]
    pub fn google_protobuf_UnknownFieldSet_MergeToInternalMetdata(
        other: *const google_protobuf_UnknownFieldSet,
        metadata: *mut google_protobuf_internal_InternalMetadataWithArena,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf15UnknownFieldSet26SpaceUsedExcludingSelfLongEv"]
    pub fn google_protobuf_UnknownFieldSet_SpaceUsedExcludingSelfLong(
        this: *const google_protobuf_UnknownFieldSet,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf15UnknownFieldSet13SpaceUsedLongEv"]
    pub fn google_protobuf_UnknownFieldSet_SpaceUsedLong(
        this: *const google_protobuf_UnknownFieldSet,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet9AddVarintEiy"]
    pub fn google_protobuf_UnknownFieldSet_AddVarint(
        this: *mut google_protobuf_UnknownFieldSet,
        number: ::std::os::raw::c_int,
        value: google_protobuf_uint64,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet10AddFixed32Eij"]
    pub fn google_protobuf_UnknownFieldSet_AddFixed32(
        this: *mut google_protobuf_UnknownFieldSet,
        number: ::std::os::raw::c_int,
        value: google_protobuf_uint32,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet10AddFixed64Eiy"]
    pub fn google_protobuf_UnknownFieldSet_AddFixed64(
        this: *mut google_protobuf_UnknownFieldSet,
        number: ::std::os::raw::c_int,
        value: google_protobuf_uint64,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet18AddLengthDelimitedEiRKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_UnknownFieldSet_AddLengthDelimited(
        this: *mut google_protobuf_UnknownFieldSet,
        number: ::std::os::raw::c_int,
        value: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet18AddLengthDelimitedEi"]
    pub fn google_protobuf_UnknownFieldSet_AddLengthDelimited1(
        this: *mut google_protobuf_UnknownFieldSet,
        number: ::std::os::raw::c_int,
    ) -> *mut std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet8AddGroupEi"]
    pub fn google_protobuf_UnknownFieldSet_AddGroup(
        this: *mut google_protobuf_UnknownFieldSet,
        number: ::std::os::raw::c_int,
    ) -> *mut google_protobuf_UnknownFieldSet;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet8AddFieldERKNS0_12UnknownFieldE"]
    pub fn google_protobuf_UnknownFieldSet_AddField(
        this: *mut google_protobuf_UnknownFieldSet,
        field: *const google_protobuf_UnknownField,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet14DeleteSubrangeEii"]
    pub fn google_protobuf_UnknownFieldSet_DeleteSubrange(
        this: *mut google_protobuf_UnknownFieldSet,
        start: ::std::os::raw::c_int,
        num: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet14DeleteByNumberEi"]
    pub fn google_protobuf_UnknownFieldSet_DeleteByNumber(
        this: *mut google_protobuf_UnknownFieldSet,
        number: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet20MergeFromCodedStreamEPNS0_2io16CodedInputStreamE"]
    pub fn google_protobuf_UnknownFieldSet_MergeFromCodedStream(
        this: *mut google_protobuf_UnknownFieldSet,
        input: *mut google_protobuf_io_CodedInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet20ParseFromCodedStreamEPNS0_2io16CodedInputStreamE"]
    pub fn google_protobuf_UnknownFieldSet_ParseFromCodedStream(
        this: *mut google_protobuf_UnknownFieldSet,
        input: *mut google_protobuf_io_CodedInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet23ParseFromZeroCopyStreamEPNS0_2io19ZeroCopyInputStreamE"]
    pub fn google_protobuf_UnknownFieldSet_ParseFromZeroCopyStream(
        this: *mut google_protobuf_UnknownFieldSet,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet14ParseFromArrayEPKvi"]
    pub fn google_protobuf_UnknownFieldSet_ParseFromArray(
        this: *mut google_protobuf_UnknownFieldSet,
        data: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSet16default_instanceEv"]
    pub fn google_protobuf_UnknownFieldSet_default_instance(
    ) -> *const google_protobuf_UnknownFieldSet;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSetC1Ev"]
    pub fn google_protobuf_UnknownFieldSet_UnknownFieldSet(
        this: *mut google_protobuf_UnknownFieldSet,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf15UnknownFieldSetD1Ev"]
    pub fn google_protobuf_UnknownFieldSet_UnknownFieldSet_destructor(
        this: *mut google_protobuf_UnknownFieldSet,
    );
}
impl google_protobuf_UnknownFieldSet {
    #[inline]
    pub unsafe fn ClearAndFreeMemory(&mut self) {
        google_protobuf_UnknownFieldSet_ClearAndFreeMemory(self)
    }
    #[inline]
    pub unsafe fn MergeFrom(&mut self, other: *const google_protobuf_UnknownFieldSet) {
        google_protobuf_UnknownFieldSet_MergeFrom(self, other)
    }
    #[inline]
    pub unsafe fn MergeFromAndDestroy(&mut self, other: *mut google_protobuf_UnknownFieldSet) {
        google_protobuf_UnknownFieldSet_MergeFromAndDestroy(self, other)
    }
    #[inline]
    pub unsafe fn MergeToInternalMetdata(
        other: *const google_protobuf_UnknownFieldSet,
        metadata: *mut google_protobuf_internal_InternalMetadataWithArena,
    ) {
        google_protobuf_UnknownFieldSet_MergeToInternalMetdata(other, metadata)
    }
    #[inline]
    pub unsafe fn SpaceUsedExcludingSelfLong(&self) -> usize {
        google_protobuf_UnknownFieldSet_SpaceUsedExcludingSelfLong(self)
    }
    #[inline]
    pub unsafe fn SpaceUsedLong(&self) -> usize {
        google_protobuf_UnknownFieldSet_SpaceUsedLong(self)
    }
    #[inline]
    pub unsafe fn AddVarint(
        &mut self,
        number: ::std::os::raw::c_int,
        value: google_protobuf_uint64,
    ) {
        google_protobuf_UnknownFieldSet_AddVarint(self, number, value)
    }
    #[inline]
    pub unsafe fn AddFixed32(
        &mut self,
        number: ::std::os::raw::c_int,
        value: google_protobuf_uint32,
    ) {
        google_protobuf_UnknownFieldSet_AddFixed32(self, number, value)
    }
    #[inline]
    pub unsafe fn AddFixed64(
        &mut self,
        number: ::std::os::raw::c_int,
        value: google_protobuf_uint64,
    ) {
        google_protobuf_UnknownFieldSet_AddFixed64(self, number, value)
    }
    #[inline]
    pub unsafe fn AddLengthDelimited(
        &mut self,
        number: ::std::os::raw::c_int,
        value: *const std_string,
    ) {
        google_protobuf_UnknownFieldSet_AddLengthDelimited(self, number, value)
    }
    #[inline]
    pub unsafe fn AddLengthDelimited1(&mut self, number: ::std::os::raw::c_int) -> *mut std_string {
        google_protobuf_UnknownFieldSet_AddLengthDelimited1(self, number)
    }
    #[inline]
    pub unsafe fn AddGroup(
        &mut self,
        number: ::std::os::raw::c_int,
    ) -> *mut google_protobuf_UnknownFieldSet {
        google_protobuf_UnknownFieldSet_AddGroup(self, number)
    }
    #[inline]
    pub unsafe fn AddField(&mut self, field: *const google_protobuf_UnknownField) {
        google_protobuf_UnknownFieldSet_AddField(self, field)
    }
    #[inline]
    pub unsafe fn DeleteSubrange(
        &mut self,
        start: ::std::os::raw::c_int,
        num: ::std::os::raw::c_int,
    ) {
        google_protobuf_UnknownFieldSet_DeleteSubrange(self, start, num)
    }
    #[inline]
    pub unsafe fn DeleteByNumber(&mut self, number: ::std::os::raw::c_int) {
        google_protobuf_UnknownFieldSet_DeleteByNumber(self, number)
    }
    #[inline]
    pub unsafe fn MergeFromCodedStream(
        &mut self,
        input: *mut google_protobuf_io_CodedInputStream,
    ) -> bool {
        google_protobuf_UnknownFieldSet_MergeFromCodedStream(self, input)
    }
    #[inline]
    pub unsafe fn ParseFromCodedStream(
        &mut self,
        input: *mut google_protobuf_io_CodedInputStream,
    ) -> bool {
        google_protobuf_UnknownFieldSet_ParseFromCodedStream(self, input)
    }
    #[inline]
    pub unsafe fn ParseFromZeroCopyStream(
        &mut self,
        input: *mut google_protobuf_io_ZeroCopyInputStream,
    ) -> bool {
        google_protobuf_UnknownFieldSet_ParseFromZeroCopyStream(self, input)
    }
    #[inline]
    pub unsafe fn ParseFromArray(
        &mut self,
        data: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> bool {
        google_protobuf_UnknownFieldSet_ParseFromArray(self, data, size)
    }
    #[inline]
    pub unsafe fn default_instance() -> *const google_protobuf_UnknownFieldSet {
        google_protobuf_UnknownFieldSet_default_instance()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        google_protobuf_UnknownFieldSet_UnknownFieldSet(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        google_protobuf_UnknownFieldSet_UnknownFieldSet_destructor(self)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct google_protobuf_UnknownField {
    pub number_: google_protobuf_uint32,
    pub type_: google_protobuf_uint32,
    pub data_: google_protobuf_UnknownField__bindgen_ty_1,
}
pub const google_protobuf_UnknownField_Type_TYPE_VARINT: google_protobuf_UnknownField_Type = 0;
pub const google_protobuf_UnknownField_Type_TYPE_FIXED32: google_protobuf_UnknownField_Type = 1;
pub const google_protobuf_UnknownField_Type_TYPE_FIXED64: google_protobuf_UnknownField_Type = 2;
pub const google_protobuf_UnknownField_Type_TYPE_LENGTH_DELIMITED:
    google_protobuf_UnknownField_Type = 3;
pub const google_protobuf_UnknownField_Type_TYPE_GROUP: google_protobuf_UnknownField_Type = 4;
pub type google_protobuf_UnknownField_Type = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union google_protobuf_UnknownField_LengthDelimited {
    pub string_value: *mut std_string,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_google_protobuf_UnknownField_LengthDelimited() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_UnknownField_LengthDelimited>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_UnknownField_LengthDelimited)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_UnknownField_LengthDelimited>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_UnknownField_LengthDelimited)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_UnknownField_LengthDelimited>())).string_value
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_UnknownField_LengthDelimited),
            "::",
            stringify!(string_value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union google_protobuf_UnknownField__bindgen_ty_1 {
    pub varint_: google_protobuf_uint64,
    pub fixed32_: google_protobuf_uint32,
    pub fixed64_: google_protobuf_uint64,
    pub length_delimited_: google_protobuf_UnknownField_LengthDelimited,
    pub group_: *mut google_protobuf_UnknownFieldSet,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_google_protobuf_UnknownField__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_UnknownField__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_UnknownField__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_UnknownField__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_UnknownField__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_UnknownField__bindgen_ty_1>())).varint_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_UnknownField__bindgen_ty_1),
            "::",
            stringify!(varint_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_UnknownField__bindgen_ty_1>())).fixed32_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_UnknownField__bindgen_ty_1),
            "::",
            stringify!(fixed32_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_UnknownField__bindgen_ty_1>())).fixed64_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_UnknownField__bindgen_ty_1),
            "::",
            stringify!(fixed64_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_UnknownField__bindgen_ty_1>())).length_delimited_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_UnknownField__bindgen_ty_1),
            "::",
            stringify!(length_delimited_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_UnknownField__bindgen_ty_1>())).group_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_UnknownField__bindgen_ty_1),
            "::",
            stringify!(group_)
        )
    );
}
#[test]
fn bindgen_test_layout_google_protobuf_UnknownField() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_UnknownField>(),
        16usize,
        concat!("Size of: ", stringify!(google_protobuf_UnknownField))
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_UnknownField>(),
        8usize,
        concat!("Alignment of ", stringify!(google_protobuf_UnknownField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_UnknownField>())).number_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_UnknownField),
            "::",
            stringify!(number_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_UnknownField>())).type_ as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_UnknownField),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_UnknownField>())).data_ as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_UnknownField),
            "::",
            stringify!(data_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf12UnknownField29SerializeLengthDelimitedNoTagEPNS0_2io17CodedOutputStreamE"]
    pub fn google_protobuf_UnknownField_SerializeLengthDelimitedNoTag(
        this: *const google_protobuf_UnknownField,
        output: *mut google_protobuf_io_CodedOutputStream,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf12UnknownField36SerializeLengthDelimitedNoTagToArrayEPh"]
    pub fn google_protobuf_UnknownField_SerializeLengthDelimitedNoTagToArray(
        this: *const google_protobuf_UnknownField,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8;
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf12UnknownField6DeleteEv"]
    pub fn google_protobuf_UnknownField_Delete(this: *mut google_protobuf_UnknownField);
}
extern "C" {
    #[link_name = "\u{1}__ZN6google8protobuf12UnknownField8DeepCopyERKS1_"]
    pub fn google_protobuf_UnknownField_DeepCopy(
        this: *mut google_protobuf_UnknownField,
        other: *const google_protobuf_UnknownField,
    );
}
impl google_protobuf_UnknownField {
    #[inline]
    pub unsafe fn SerializeLengthDelimitedNoTag(
        &self,
        output: *mut google_protobuf_io_CodedOutputStream,
    ) {
        google_protobuf_UnknownField_SerializeLengthDelimitedNoTag(self, output)
    }
    #[inline]
    pub unsafe fn SerializeLengthDelimitedNoTagToArray(
        &self,
        target: *mut google_protobuf_uint8,
    ) -> *mut google_protobuf_uint8 {
        google_protobuf_UnknownField_SerializeLengthDelimitedNoTagToArray(self, target)
    }
    #[inline]
    pub unsafe fn Delete(&mut self) {
        google_protobuf_UnknownField_Delete(self)
    }
    #[inline]
    pub unsafe fn DeepCopy(&mut self, other: *const google_protobuf_UnknownField) {
        google_protobuf_UnknownField_DeepCopy(self, other)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_DescriptorDatabase {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_DescriptorProto {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_DescriptorProto_ExtensionRange {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_FieldDescriptorProto {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_OneofDescriptorProto {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_EnumDescriptorProto {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_EnumValueDescriptorProto {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_ServiceDescriptorProto {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_MethodDescriptorProto {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_FileDescriptorProto {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_MessageOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_FieldOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_OneofOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_EnumOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_EnumValueOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_ExtensionRangeOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_ServiceOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_MethodOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_FileOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_SourceCodeInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_FileDescriptorTables {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct google_protobuf_SourceLocation {
    pub start_line: ::std::os::raw::c_int,
    pub end_line: ::std::os::raw::c_int,
    pub start_column: ::std::os::raw::c_int,
    pub end_column: ::std::os::raw::c_int,
    pub leading_comments: std_string,
    pub trailing_comments: std_string,
    pub leading_detached_comments: std_vector,
}
#[test]
fn bindgen_test_layout_google_protobuf_SourceLocation() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_SourceLocation>(),
        88usize,
        concat!("Size of: ", stringify!(google_protobuf_SourceLocation))
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_SourceLocation>(),
        8usize,
        concat!("Alignment of ", stringify!(google_protobuf_SourceLocation))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_SourceLocation>())).start_line as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_SourceLocation),
            "::",
            stringify!(start_line)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_SourceLocation>())).end_line as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_SourceLocation),
            "::",
            stringify!(end_line)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_SourceLocation>())).start_column as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_SourceLocation),
            "::",
            stringify!(start_column)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_SourceLocation>())).end_column as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_SourceLocation),
            "::",
            stringify!(end_column)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_SourceLocation>())).leading_comments as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_SourceLocation),
            "::",
            stringify!(leading_comments)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_SourceLocation>())).trailing_comments as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_SourceLocation),
            "::",
            stringify!(trailing_comments)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_SourceLocation>())).leading_detached_comments
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_SourceLocation),
            "::",
            stringify!(leading_detached_comments)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_DebugStringOptions {
    pub include_comments: bool,
    pub elide_group_body: bool,
    pub elide_oneof_body: bool,
}
#[test]
fn bindgen_test_layout_google_protobuf_DebugStringOptions() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_DebugStringOptions>(),
        3usize,
        concat!("Size of: ", stringify!(google_protobuf_DebugStringOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_DebugStringOptions>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_DebugStringOptions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_DebugStringOptions>())).include_comments
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_DebugStringOptions),
            "::",
            stringify!(include_comments)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_DebugStringOptions>())).elide_group_body
                as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_DebugStringOptions),
            "::",
            stringify!(elide_group_body)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_DebugStringOptions>())).elide_oneof_body
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_DebugStringOptions),
            "::",
            stringify!(elide_oneof_body)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_Descriptor {
    pub name_: *const std_string,
    pub full_name_: *const std_string,
    pub file_: *const google_protobuf_FileDescriptor,
    pub containing_type_: *const google_protobuf_Descriptor,
    pub options_: *const google_protobuf_MessageOptions,
    pub fields_: *mut google_protobuf_FieldDescriptor,
    pub oneof_decls_: *mut google_protobuf_OneofDescriptor,
    pub nested_types_: *mut google_protobuf_Descriptor,
    pub enum_types_: *mut google_protobuf_EnumDescriptor,
    pub extension_ranges_: *mut google_protobuf_Descriptor_ExtensionRange,
    pub extensions_: *mut google_protobuf_FieldDescriptor,
    pub reserved_ranges_: *mut google_protobuf_Descriptor_ReservedRange,
    pub reserved_names_: *mut *const std_string,
    pub field_count_: ::std::os::raw::c_int,
    pub oneof_decl_count_: ::std::os::raw::c_int,
    pub nested_type_count_: ::std::os::raw::c_int,
    pub enum_type_count_: ::std::os::raw::c_int,
    pub extension_range_count_: ::std::os::raw::c_int,
    pub extension_count_: ::std::os::raw::c_int,
    pub reserved_range_count_: ::std::os::raw::c_int,
    pub reserved_name_count_: ::std::os::raw::c_int,
    pub is_placeholder_: bool,
    pub is_unqualified_placeholder_: bool,
}
pub type google_protobuf_Descriptor_Proto = google_protobuf_DescriptorProto;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_Descriptor_ExtensionRange {
    pub start: ::std::os::raw::c_int,
    pub end: ::std::os::raw::c_int,
    pub options_: *const google_protobuf_ExtensionRangeOptions,
}
pub type google_protobuf_Descriptor_ExtensionRange_Proto =
    google_protobuf_DescriptorProto_ExtensionRange;
pub type google_protobuf_Descriptor_ExtensionRange_OptionsType =
    google_protobuf_ExtensionRangeOptions;
#[test]
fn bindgen_test_layout_google_protobuf_Descriptor_ExtensionRange() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_Descriptor_ExtensionRange>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_Descriptor_ExtensionRange)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_Descriptor_ExtensionRange>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_Descriptor_ExtensionRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor_ExtensionRange>())).start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor_ExtensionRange),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor_ExtensionRange>())).end as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor_ExtensionRange),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor_ExtensionRange>())).options_
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor_ExtensionRange),
            "::",
            stringify!(options_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor14ExtensionRange6CopyToEPNS0_30DescriptorProto_ExtensionRangeE"]
    pub fn google_protobuf_Descriptor_ExtensionRange_CopyTo(
        this: *const google_protobuf_Descriptor_ExtensionRange,
        proto: *mut google_protobuf_DescriptorProto_ExtensionRange,
    );
}
impl google_protobuf_Descriptor_ExtensionRange {
    #[inline]
    pub unsafe fn CopyTo(&self, proto: *mut google_protobuf_DescriptorProto_ExtensionRange) {
        google_protobuf_Descriptor_ExtensionRange_CopyTo(self, proto)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct google_protobuf_Descriptor_ReservedRange {
    pub start: ::std::os::raw::c_int,
    pub end: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_google_protobuf_Descriptor_ReservedRange() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_Descriptor_ReservedRange>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_Descriptor_ReservedRange)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_Descriptor_ReservedRange>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_Descriptor_ReservedRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor_ReservedRange>())).start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor_ReservedRange),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor_ReservedRange>())).end as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor_ReservedRange),
            "::",
            stringify!(end)
        )
    );
}
pub type google_protobuf_Descriptor_OptionsType = google_protobuf_MessageOptions;
#[test]
fn bindgen_test_layout_google_protobuf_Descriptor() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_Descriptor>(),
        144usize,
        concat!("Size of: ", stringify!(google_protobuf_Descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_Descriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(google_protobuf_Descriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).name_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(name_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).full_name_ as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(full_name_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).file_ as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(file_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).containing_type_ as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(containing_type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).options_ as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(options_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).fields_ as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(fields_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).oneof_decls_ as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(oneof_decls_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).nested_types_ as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(nested_types_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).enum_types_ as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(enum_types_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).extension_ranges_ as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(extension_ranges_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).extensions_ as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(extensions_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).reserved_ranges_ as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(reserved_ranges_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).reserved_names_ as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(reserved_names_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).field_count_ as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(field_count_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).oneof_decl_count_ as *const _
                as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(oneof_decl_count_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).nested_type_count_ as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(nested_type_count_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).enum_type_count_ as *const _
                as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(enum_type_count_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).extension_range_count_
                as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(extension_range_count_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).extension_count_ as *const _
                as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(extension_count_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).reserved_range_count_ as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(reserved_range_count_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).reserved_name_count_ as *const _
                as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(reserved_name_count_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).is_placeholder_ as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(is_placeholder_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_Descriptor>())).is_unqualified_placeholder_
                as *const _ as usize
        },
        137usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_Descriptor),
            "::",
            stringify!(is_unqualified_placeholder_)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor4nameEv"]
    pub fn google_protobuf_Descriptor_name(
        this: *const google_protobuf_Descriptor,
    ) -> *const std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor9full_nameEv"]
    pub fn google_protobuf_Descriptor_full_name(
        this: *const google_protobuf_Descriptor,
    ) -> *const std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor5indexEv"]
    pub fn google_protobuf_Descriptor_index(
        this: *const google_protobuf_Descriptor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor4fileEv"]
    pub fn google_protobuf_Descriptor_file(
        this: *const google_protobuf_Descriptor,
    ) -> *const google_protobuf_FileDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor15containing_typeEv"]
    pub fn google_protobuf_Descriptor_containing_type(
        this: *const google_protobuf_Descriptor,
    ) -> *const google_protobuf_Descriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor7optionsEv"]
    pub fn google_protobuf_Descriptor_options(
        this: *const google_protobuf_Descriptor,
    ) -> *const google_protobuf_MessageOptions;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor6CopyToEPNS0_15DescriptorProtoE"]
    pub fn google_protobuf_Descriptor_CopyTo(
        this: *const google_protobuf_Descriptor,
        proto: *mut google_protobuf_DescriptorProto,
    );
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor11DebugStringEv"]
    pub fn google_protobuf_Descriptor_DebugString(
        this: *const google_protobuf_Descriptor,
    ) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor22DebugStringWithOptionsERKNS0_18DebugStringOptionsE"]
    pub fn google_protobuf_Descriptor_DebugStringWithOptions(
        this: *const google_protobuf_Descriptor,
        options: *const google_protobuf_DebugStringOptions,
    ) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor14is_placeholderEv"]
    pub fn google_protobuf_Descriptor_is_placeholder(
        this: *const google_protobuf_Descriptor,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor11field_countEv"]
    pub fn google_protobuf_Descriptor_field_count(
        this: *const google_protobuf_Descriptor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor5fieldEi"]
    pub fn google_protobuf_Descriptor_field(
        this: *const google_protobuf_Descriptor,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_FieldDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor17FindFieldByNumberEi"]
    pub fn google_protobuf_Descriptor_FindFieldByNumber(
        this: *const google_protobuf_Descriptor,
        number: ::std::os::raw::c_int,
    ) -> *const google_protobuf_FieldDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor15FindFieldByNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_FindFieldByName(
        this: *const google_protobuf_Descriptor,
        name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor24FindFieldByLowercaseNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_FindFieldByLowercaseName(
        this: *const google_protobuf_Descriptor,
        lowercase_name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor24FindFieldByCamelcaseNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_FindFieldByCamelcaseName(
        this: *const google_protobuf_Descriptor,
        camelcase_name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor16oneof_decl_countEv"]
    pub fn google_protobuf_Descriptor_oneof_decl_count(
        this: *const google_protobuf_Descriptor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor10oneof_declEi"]
    pub fn google_protobuf_Descriptor_oneof_decl(
        this: *const google_protobuf_Descriptor,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_OneofDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor15FindOneofByNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_FindOneofByName(
        this: *const google_protobuf_Descriptor,
        name: *const std_string,
    ) -> *const google_protobuf_OneofDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor17nested_type_countEv"]
    pub fn google_protobuf_Descriptor_nested_type_count(
        this: *const google_protobuf_Descriptor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor11nested_typeEi"]
    pub fn google_protobuf_Descriptor_nested_type(
        this: *const google_protobuf_Descriptor,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_Descriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor20FindNestedTypeByNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_FindNestedTypeByName(
        this: *const google_protobuf_Descriptor,
        name: *const std_string,
    ) -> *const google_protobuf_Descriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor15enum_type_countEv"]
    pub fn google_protobuf_Descriptor_enum_type_count(
        this: *const google_protobuf_Descriptor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor9enum_typeEi"]
    pub fn google_protobuf_Descriptor_enum_type(
        this: *const google_protobuf_Descriptor,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_EnumDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor18FindEnumTypeByNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_FindEnumTypeByName(
        this: *const google_protobuf_Descriptor,
        name: *const std_string,
    ) -> *const google_protobuf_EnumDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor19FindEnumValueByNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_FindEnumValueByName(
        this: *const google_protobuf_Descriptor,
        name: *const std_string,
    ) -> *const google_protobuf_EnumValueDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor21extension_range_countEv"]
    pub fn google_protobuf_Descriptor_extension_range_count(
        this: *const google_protobuf_Descriptor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor15extension_rangeEi"]
    pub fn google_protobuf_Descriptor_extension_range(
        this: *const google_protobuf_Descriptor,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_Descriptor_ExtensionRange;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor17IsExtensionNumberEi"]
    pub fn google_protobuf_Descriptor_IsExtensionNumber(
        this: *const google_protobuf_Descriptor,
        number: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor34FindExtensionRangeContainingNumberEi"]
    pub fn google_protobuf_Descriptor_FindExtensionRangeContainingNumber(
        this: *const google_protobuf_Descriptor,
        number: ::std::os::raw::c_int,
    ) -> *const google_protobuf_Descriptor_ExtensionRange;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor15extension_countEv"]
    pub fn google_protobuf_Descriptor_extension_count(
        this: *const google_protobuf_Descriptor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor9extensionEi"]
    pub fn google_protobuf_Descriptor_extension(
        this: *const google_protobuf_Descriptor,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_FieldDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor19FindExtensionByNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_FindExtensionByName(
        this: *const google_protobuf_Descriptor,
        name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor28FindExtensionByLowercaseNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_FindExtensionByLowercaseName(
        this: *const google_protobuf_Descriptor,
        name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor28FindExtensionByCamelcaseNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_FindExtensionByCamelcaseName(
        this: *const google_protobuf_Descriptor,
        name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor20reserved_range_countEv"]
    pub fn google_protobuf_Descriptor_reserved_range_count(
        this: *const google_protobuf_Descriptor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor14reserved_rangeEi"]
    pub fn google_protobuf_Descriptor_reserved_range(
        this: *const google_protobuf_Descriptor,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_Descriptor_ReservedRange;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor16IsReservedNumberEi"]
    pub fn google_protobuf_Descriptor_IsReservedNumber(
        this: *const google_protobuf_Descriptor,
        number: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor33FindReservedRangeContainingNumberEi"]
    pub fn google_protobuf_Descriptor_FindReservedRangeContainingNumber(
        this: *const google_protobuf_Descriptor,
        number: ::std::os::raw::c_int,
    ) -> *const google_protobuf_Descriptor_ReservedRange;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor19reserved_name_countEv"]
    pub fn google_protobuf_Descriptor_reserved_name_count(
        this: *const google_protobuf_Descriptor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor13reserved_nameEi"]
    pub fn google_protobuf_Descriptor_reserved_name(
        this: *const google_protobuf_Descriptor,
        index: ::std::os::raw::c_int,
    ) -> *const std_string;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor14IsReservedNameERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"]
    pub fn google_protobuf_Descriptor_IsReservedName(
        this: *const google_protobuf_Descriptor,
        name: *const std_string,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}__ZNK6google8protobuf10Descriptor17GetSourceLocationEPNS0_14SourceLocationE"]
    pub fn google_protobuf_Descriptor_GetSourceLocation(
        this: *const google_protobuf_Descriptor,
        out_location: *mut google_protobuf_SourceLocation,
    ) -> bool;
}
impl google_protobuf_Descriptor {
    #[inline]
    pub unsafe fn name(&self) -> *const std_string {
        google_protobuf_Descriptor_name(self)
    }
    #[inline]
    pub unsafe fn full_name(&self) -> *const std_string {
        google_protobuf_Descriptor_full_name(self)
    }
    #[inline]
    pub unsafe fn index(&self) -> ::std::os::raw::c_int {
        google_protobuf_Descriptor_index(self)
    }
    #[inline]
    pub unsafe fn file(&self) -> *const google_protobuf_FileDescriptor {
        google_protobuf_Descriptor_file(self)
    }
    #[inline]
    pub unsafe fn containing_type(&self) -> *const google_protobuf_Descriptor {
        google_protobuf_Descriptor_containing_type(self)
    }
    #[inline]
    pub unsafe fn options(&self) -> *const google_protobuf_MessageOptions {
        google_protobuf_Descriptor_options(self)
    }
    #[inline]
    pub unsafe fn CopyTo(&self, proto: *mut google_protobuf_DescriptorProto) {
        google_protobuf_Descriptor_CopyTo(self, proto)
    }
    #[inline]
    pub unsafe fn DebugString(&self) -> std_string {
        google_protobuf_Descriptor_DebugString(self)
    }
    #[inline]
    pub unsafe fn DebugStringWithOptions(
        &self,
        options: *const google_protobuf_DebugStringOptions,
    ) -> std_string {
        google_protobuf_Descriptor_DebugStringWithOptions(self, options)
    }
    #[inline]
    pub unsafe fn is_placeholder(&self) -> bool {
        google_protobuf_Descriptor_is_placeholder(self)
    }
    #[inline]
    pub unsafe fn field_count(&self) -> ::std::os::raw::c_int {
        google_protobuf_Descriptor_field_count(self)
    }
    #[inline]
    pub unsafe fn field(
        &self,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_FieldDescriptor {
        google_protobuf_Descriptor_field(self, index)
    }
    #[inline]
    pub unsafe fn FindFieldByNumber(
        &self,
        number: ::std::os::raw::c_int,
    ) -> *const google_protobuf_FieldDescriptor {
        google_protobuf_Descriptor_FindFieldByNumber(self, number)
    }
    #[inline]
    pub unsafe fn FindFieldByName(
        &self,
        name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor {
        google_protobuf_Descriptor_FindFieldByName(self, name)
    }
    #[inline]
    pub unsafe fn FindFieldByLowercaseName(
        &self,
        lowercase_name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor {
        google_protobuf_Descriptor_FindFieldByLowercaseName(self, lowercase_name)
    }
    #[inline]
    pub unsafe fn FindFieldByCamelcaseName(
        &self,
        camelcase_name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor {
        google_protobuf_Descriptor_FindFieldByCamelcaseName(self, camelcase_name)
    }
    #[inline]
    pub unsafe fn oneof_decl_count(&self) -> ::std::os::raw::c_int {
        google_protobuf_Descriptor_oneof_decl_count(self)
    }
    #[inline]
    pub unsafe fn oneof_decl(
        &self,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_OneofDescriptor {
        google_protobuf_Descriptor_oneof_decl(self, index)
    }
    #[inline]
    pub unsafe fn FindOneofByName(
        &self,
        name: *const std_string,
    ) -> *const google_protobuf_OneofDescriptor {
        google_protobuf_Descriptor_FindOneofByName(self, name)
    }
    #[inline]
    pub unsafe fn nested_type_count(&self) -> ::std::os::raw::c_int {
        google_protobuf_Descriptor_nested_type_count(self)
    }
    #[inline]
    pub unsafe fn nested_type(
        &self,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_Descriptor {
        google_protobuf_Descriptor_nested_type(self, index)
    }
    #[inline]
    pub unsafe fn FindNestedTypeByName(
        &self,
        name: *const std_string,
    ) -> *const google_protobuf_Descriptor {
        google_protobuf_Descriptor_FindNestedTypeByName(self, name)
    }
    #[inline]
    pub unsafe fn enum_type_count(&self) -> ::std::os::raw::c_int {
        google_protobuf_Descriptor_enum_type_count(self)
    }
    #[inline]
    pub unsafe fn enum_type(
        &self,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_EnumDescriptor {
        google_protobuf_Descriptor_enum_type(self, index)
    }
    #[inline]
    pub unsafe fn FindEnumTypeByName(
        &self,
        name: *const std_string,
    ) -> *const google_protobuf_EnumDescriptor {
        google_protobuf_Descriptor_FindEnumTypeByName(self, name)
    }
    #[inline]
    pub unsafe fn FindEnumValueByName(
        &self,
        name: *const std_string,
    ) -> *const google_protobuf_EnumValueDescriptor {
        google_protobuf_Descriptor_FindEnumValueByName(self, name)
    }
    #[inline]
    pub unsafe fn extension_range_count(&self) -> ::std::os::raw::c_int {
        google_protobuf_Descriptor_extension_range_count(self)
    }
    #[inline]
    pub unsafe fn extension_range(
        &self,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_Descriptor_ExtensionRange {
        google_protobuf_Descriptor_extension_range(self, index)
    }
    #[inline]
    pub unsafe fn IsExtensionNumber(&self, number: ::std::os::raw::c_int) -> bool {
        google_protobuf_Descriptor_IsExtensionNumber(self, number)
    }
    #[inline]
    pub unsafe fn FindExtensionRangeContainingNumber(
        &self,
        number: ::std::os::raw::c_int,
    ) -> *const google_protobuf_Descriptor_ExtensionRange {
        google_protobuf_Descriptor_FindExtensionRangeContainingNumber(self, number)
    }
    #[inline]
    pub unsafe fn extension_count(&self) -> ::std::os::raw::c_int {
        google_protobuf_Descriptor_extension_count(self)
    }
    #[inline]
    pub unsafe fn extension(
        &self,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_FieldDescriptor {
        google_protobuf_Descriptor_extension(self, index)
    }
    #[inline]
    pub unsafe fn FindExtensionByName(
        &self,
        name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor {
        google_protobuf_Descriptor_FindExtensionByName(self, name)
    }
    #[inline]
    pub unsafe fn FindExtensionByLowercaseName(
        &self,
        name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor {
        google_protobuf_Descriptor_FindExtensionByLowercaseName(self, name)
    }
    #[inline]
    pub unsafe fn FindExtensionByCamelcaseName(
        &self,
        name: *const std_string,
    ) -> *const google_protobuf_FieldDescriptor {
        google_protobuf_Descriptor_FindExtensionByCamelcaseName(self, name)
    }
    #[inline]
    pub unsafe fn reserved_range_count(&self) -> ::std::os::raw::c_int {
        google_protobuf_Descriptor_reserved_range_count(self)
    }
    #[inline]
    pub unsafe fn reserved_range(
        &self,
        index: ::std::os::raw::c_int,
    ) -> *const google_protobuf_Descriptor_ReservedRange {
        google_protobuf_Descriptor_reserved_range(self, index)
    }
    #[inline]
    pub unsafe fn IsReservedNumber(&self, number: ::std::os::raw::c_int) -> bool {
        google_protobuf_Descriptor_IsReservedNumber(self, number)
    }
    #[inline]
    pub unsafe fn FindReservedRangeContainingNumber(
        &self,
        number: ::std::os::raw::c_int,
    ) -> *const google_protobuf_Descriptor_ReservedRange {
        google_protobuf_Descriptor_FindReservedRangeContainingNumber(self, number)
    }
    #[inline]
    pub unsafe fn reserved_name_count(&self) -> ::std::os::raw::c_int {
        google_protobuf_Descriptor_reserved_name_count(self)
    }
    #[inline]
    pub unsafe fn reserved_name(&self, index: ::std::os::raw::c_int) -> *const std_string {
        google_protobuf_Descriptor_reserved_name(self, index)
    }
    #[inline]
    pub unsafe fn IsReservedName(&self, name: *const std_string) -> bool {
        google_protobuf_Descriptor_IsReservedName(self, name)
    }
    #[inline]
    pub unsafe fn GetSourceLocation(
        &self,
        out_location: *mut google_protobuf_SourceLocation,
    ) -> bool {
        google_protobuf_Descriptor_GetSourceLocation(self, out_location)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct google_protobuf_FieldDescriptor {
    pub name_: *const std_string,
    pub full_name_: *const std_string,
    pub lowercase_name_: *const std_string,
    pub camelcase_name_: *const std_string,
    pub json_name_: *const std_string,
    pub file_: *const google_protobuf_FileDescriptor,
    pub type_once_: *mut google_protobuf_internal_once_flag,
    pub type_: google_protobuf_FieldDescriptor_Type,
    pub label_: google_protobuf_FieldDescriptor_Label,
    pub has_default_value_: bool,
    pub has_json_name_: bool,
    pub is_extension_: bool,
    pub number_: ::std::os::raw::c_int,
    pub index_in_oneof_: ::std::os::raw::c_int,
    pub containing_type_: *const google_protobuf_Descriptor,
    pub containing_oneof_: *const google_protobuf_OneofDescriptor,
    pub extension_scope_: *const google_protobuf_Descriptor,
    pub message_type_: *const google_protobuf_Descriptor,
    pub enum_type_: *const google_protobuf_EnumDescriptor,
    pub options_: *const google_protobuf_FieldOptions,
    pub type_name_: *const std_string,
    pub default_value_enum_name_: *const std_string,
    pub __bindgen_anon_1: google_protobuf_FieldDescriptor__bindgen_ty_1,
}
pub type google_protobuf_FieldDescriptor_Proto = google_protobuf_FieldDescriptorProto;
pub const google_protobuf_FieldDescriptor_Type_TYPE_DOUBLE: google_protobuf_FieldDescriptor_Type =
    1;
pub const google_protobuf_FieldDescriptor_Type_TYPE_FLOAT: google_protobuf_FieldDescriptor_Type = 2;
pub const google_protobuf_FieldDescriptor_Type_TYPE_INT64: google_protobuf_FieldDescriptor_Type = 3;
pub const google_protobuf_FieldDescriptor_Type_TYPE_UINT64: google_protobuf_FieldDescriptor_Type =
    4;
pub const google_protobuf_FieldDescriptor_Type_TYPE_INT32: google_protobuf_FieldDescriptor_Type = 5;
pub const google_protobuf_FieldDescriptor_Type_TYPE_FIXED64: google_protobuf_FieldDescriptor_Type =
    6;
pub const google_protobuf_FieldDescriptor_Type_TYPE_FIXED32: google_protobuf_FieldDescriptor_Type =
    7;
pub const google_protobuf_FieldDescriptor_Type_TYPE_BOOL: google_protobuf_FieldDescriptor_Type = 8;
pub const google_protobuf_FieldDescriptor_Type_TYPE_STRING: google_protobuf_FieldDescriptor_Type =
    9;
pub const google_protobuf_FieldDescriptor_Type_TYPE_GROUP: google_protobuf_FieldDescriptor_Type =
    10;
pub const google_protobuf_FieldDescriptor_Type_TYPE_MESSAGE: google_protobuf_FieldDescriptor_Type =
    11;
pub const google_protobuf_FieldDescriptor_Type_TYPE_BYTES: google_protobuf_FieldDescriptor_Type =
    12;
pub const google_protobuf_FieldDescriptor_Type_TYPE_UINT32: google_protobuf_FieldDescriptor_Type =
    13;
pub const google_protobuf_FieldDescriptor_Type_TYPE_ENUM: google_protobuf_FieldDescriptor_Type = 14;
pub const google_protobuf_FieldDescriptor_Type_TYPE_SFIXED32: google_protobuf_FieldDescriptor_Type =
    15;
pub const google_protobuf_FieldDescriptor_Type_TYPE_SFIXED64: google_protobuf_FieldDescriptor_Type =
    16;
pub const google_protobuf_FieldDescriptor_Type_TYPE_SINT32: google_protobuf_FieldDescriptor_Type =
    17;
pub const google_protobuf_FieldDescriptor_Type_TYPE_SINT64: google_protobuf_FieldDescriptor_Type =
    18;
pub const google_protobuf_FieldDescriptor_Type_MAX_TYPE: google_protobuf_FieldDescriptor_Type = 18;
pub type google_protobuf_FieldDescriptor_Type = u32;
pub const google_protobuf_FieldDescriptor_CppType_CPPTYPE_INT32:
    google_protobuf_FieldDescriptor_CppType = 1;
pub const google_protobuf_FieldDescriptor_CppType_CPPTYPE_INT64:
    google_protobuf_FieldDescriptor_CppType = 2;
pub const google_protobuf_FieldDescriptor_CppType_CPPTYPE_UINT32:
    google_protobuf_FieldDescriptor_CppType = 3;
pub const google_protobuf_FieldDescriptor_CppType_CPPTYPE_UINT64:
    google_protobuf_FieldDescriptor_CppType = 4;
pub const google_protobuf_FieldDescriptor_CppType_CPPTYPE_DOUBLE:
    google_protobuf_FieldDescriptor_CppType = 5;
pub const google_protobuf_FieldDescriptor_CppType_CPPTYPE_FLOAT:
    google_protobuf_FieldDescriptor_CppType = 6;
pub const google_protobuf_FieldDescriptor_CppType_CPPTYPE_BOOL:
    google_protobuf_FieldDescriptor_CppType = 7;
pub const google_protobuf_FieldDescriptor_CppType_CPPTYPE_ENUM:
    google_protobuf_FieldDescriptor_CppType = 8;
pub const google_protobuf_FieldDescriptor_CppType_CPPTYPE_STRING:
    google_protobuf_FieldDescriptor_CppType = 9;
pub const google_protobuf_FieldDescriptor_CppType_CPPTYPE_MESSAGE:
    google_protobuf_FieldDescriptor_CppType = 10;
pub const google_protobuf_FieldDescriptor_CppType_MAX_CPPTYPE:
    google_protobuf_FieldDescriptor_CppType = 10;
pub type google_protobuf_FieldDescriptor_CppType = u32;
pub const google_protobuf_FieldDescriptor_Label_LABEL_OPTIONAL:
    google_protobuf_FieldDescriptor_Label = 1;
pub const google_protobuf_FieldDescriptor_Label_LABEL_REQUIRED:
    google_protobuf_FieldDescriptor_Label = 2;
pub const google_protobuf_FieldDescriptor_Label_LABEL_REPEATED:
    google_protobuf_FieldDescriptor_Label = 3;
pub const google_protobuf_FieldDescriptor_Label_MAX_LABEL: google_protobuf_FieldDescriptor_Label =
    3;
pub type google_protobuf_FieldDescriptor_Label = u32;
pub type google_protobuf_FieldDescriptor_OptionsType = google_protobuf_FieldOptions;
pub const google_protobuf_FieldDescriptor_PrintLabelFlag_PRINT_LABEL:
    google_protobuf_FieldDescriptor_PrintLabelFlag = 0;
pub const google_protobuf_FieldDescriptor_PrintLabelFlag_OMIT_LABEL:
    google_protobuf_FieldDescriptor_PrintLabelFlag = 1;
pub type google_protobuf_FieldDescriptor_PrintLabelFlag = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union google_protobuf_FieldDescriptor__bindgen_ty_1 {
    pub default_value_int32_: google_protobuf_int32,
    pub default_value_int64_: google_protobuf_int64,
    pub default_value_uint32_: google_protobuf_uint32,
    pub default_value_uint64_: google_protobuf_uint64,
    pub default_value_float_: f32,
    pub default_value_double_: f64,
    pub default_value_bool_: bool,
    pub default_value_enum_: *const google_protobuf_EnumValueDescriptor,
    pub default_value_string_: *const std_string,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_google_protobuf_FieldDescriptor__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<google_protobuf_FieldDescriptor__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<google_protobuf_FieldDescriptor__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_FieldDescriptor__bindgen_ty_1>()))
                .default_value_int32_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1),
            "::",
            stringify!(default_value_int32_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_FieldDescriptor__bindgen_ty_1>()))
                .default_value_int64_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1),
            "::",
            stringify!(default_value_int64_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_FieldDescriptor__bindgen_ty_1>()))
                .default_value_uint32_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1),
            "::",
            stringify!(default_value_uint32_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_FieldDescriptor__bindgen_ty_1>()))
                .default_value_uint64_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1),
            "::",
            stringify!(default_value_uint64_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_FieldDescriptor__bindgen_ty_1>()))
                .default_value_float_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1),
            "::",
            stringify!(default_value_float_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_FieldDescriptor__bindgen_ty_1>()))
                .default_value_double_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1),
            "::",
            stringify!(default_value_double_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_FieldDescriptor__bindgen_ty_1>()))
                .default_value_bool_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1),
            "::",
            stringify!(default_value_bool_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_FieldDescriptor__bindgen_ty_1>()))
                .default_value_enum_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1),
            "::",
            stringify!(default_value_enum_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<google_protobuf_FieldDescriptor__bindgen_ty_1>()))
                .default_value_string_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(google_protobuf_FieldDescriptor__bindgen_ty_1),
            "::",
